<?php
$access_token = 'wyNwDWmwcKmIUbQG5FkjglxrQiOa75M5LKyCbUWgeBSt7dT3UWkV7FHgdT2mjQkBNJk/8ER9a5jO2hydIZJwSE5q0j/veSV3UU89JAP0hEXiSiPo+1kittDzOTiA4Y254IuTo4t6d/WFtWmh3EGD+QdB04t89/1O/w1cDnyilFU=';

// Get POST body content
$content = file_get_contents('php://input');
// Parse JSON
$events = json_decode($content, true);
// Validate parsed JSON data
if (!is_null($events['events'])) {
	// Loop through each event
/*	
	$a[0]="Mayume";
	$a[1]="xxxShark";
	$a[2]="Chimerical";
	$a[3]="Aiden";
	$a[4]="Deathover";
	$a[5]="Aunkoz";
	$a[6]="Anagura";
	$a[7]="Rosita";
	$a[8]="เอแคลร์แช่แข็ง";
	$a[9]="Sondamonday";
	$a[10]="Nongmo";
	$a[11]="Imbaboyz";
	$a[12]="หญิงกลาง";
	$a[13]="Urara";
	$a[14]="Meijuan";
	*/
$a[0]="บ.ชาบูจัง จำกัด";
$a[1]="ชายสี่หมี่เกี๊ยว";
$a[2]="ร้านลมเย็น";
$a[3]="ร้านบะหมี่ ป๋าเทพ";
$a[4]="ร้านราดหน้า";
$a[5]="ยิ่งเฮ็งส้มตำเรือนหนองคาย";
$a[6]="ร้านเป็ดย่างคูเมือง";
$a[7]="ก๋วยเตี๋ยวเรือป้าแต๋ว2";
$a[8]="สเต็ก๑๐๐ล้าน";
$a[9]="ร้านข้าวหอม ข้าวตัง";
$a[10]="ร้านข้าวหอม ข้าวตัง";
$a[11]="ร้านยันรันเวย์";
$a[12]="ร้านก๋วยเตี๋ยวเรืออนุเสาวรีย์สาขา2";
$a[13]="ก๋วยเตี๋ยวต้มยำ ต้นท้อน";
$a[14]="คูซิหม่าปิงย่างผ่าเหล่า";
$a[15]="ครัวศรีระสันต์";
$a[16]="ข้าวแกง ป้านงค์";
$a[17]="Say Yes";
$a[18]="คุณสุภาวีร์ ศรีภัสรรศุภะกร";
$a[19]="ร้านก๋วยเตี๋ยวเรือเป็นต่อ";
$a[20]="24/25 ตามสั่ง24ชั่วโมง";
$a[21]="กินดี";
$a[22]="พี่ฉ๊ะ";
$a[23]="ร้านครัวอิสลามเมืองลุง";
$a[24]="ร้านเด็ดดวง ก๋วยเตี๋ยวไก่แต่แรก";
$a[25]="ร้านกระท่อมลุงบอย";
$a[26]="ร้านเจ้จูข้าวหมูทอด";
$a[27]="คุณจินดา พองเพ็ธร";
$a[28]="คุณณัฐรดา ยานะใจ";
$a[29]="ร้านข้าวแกงบ้านชั้น";
$a[30]="ปลาร้าคาร์เฟ่";
$a[31]="หนมจีน.ณ.ภูเก็ต@Hatyai";
$a[32]="เราและนาย";
$a[33]="เนื้อต้มบ้านสิงห์";
$a[34]="ริมนา";
$a[35]="ร้านข้าวแกงเพื่อชีวิต";
$a[36]="The Garden Gills";
$a[37]="ใต้ต้นม่วง";
$a[38]="ร้านข้าวมันไก่";
$a[39]="ก๋วยเตี๋ยวเรือลุงรูญ 2";
$a[40]="ก๋วยเตี๋ยวดู๋ดี๋";
$a[41]="ร้านอาหาร เหนือ อีสาน";
$a[42]="ข้าวต้มทรงเครื่อง";
$a[43]="อาตี๋  บะหมี่เกี้ยว";
$a[44]="ETC";
$a[45]="ร้านคุณอนุสรณ์";
$a[46]="ร้าน siney halal bistro";
$a[47]="ร้าน พี่ปุ๊ก๋วยเตี๋ยวหมูเย็นตาโพ";
$a[48]="เฮือนคำหลวง";
$a[49]="อนุสรา รักเมือง";
$a[50]="ร้านอาหารตราชั่งทอง";
$a[51]="ก๋วยเตี๋ยวหมูโบราณ";
$a[52]="Alina Pizza & Halalfood";
$a[53]="ร้านพี่สาว(จรัส)";
$a[54]="เพื่อนเพ";
$a[55]="พะยอมพิซซ่าเฟ่";
$a[56]="ตำตามสั่ง";
$a[57]="ป้าส้มอาหารตามสั่ง";
$a[58]="ร้านเพชรข้าวราดแกง";
$a[59]="ขนมจีนน้ำยาปู สร้อยหลีเป๊ะ เขต8";
$a[60]="ร้านเจ้ซง";
$a[61]="ร้านพี่กุ้ง";
$a[62]="คุณประไพ อ่อนทอง";
$a[63]="คุณ พงศ์พิชาญ  ธนเยี่ยมสิริ";
$a[64]="ร้านบ้า";
$a[65]="ร้านกุ้งตะกร้าเศรษฐี หาดใหญ่";
$a[66]="ร้านแกงส้ม คุณยุ";
$a[67]="ร้านvipส้มตำclub(สาขาบ้านพรุ)";
$a[68]="นายบุรินทร์ ชูเรือง";
$a[69]="ร้านข้าวแกงฅนโนด";
$a[70]="คุณจันทิมา ทิพย์สาลี";
$a[71]="ร้านติดใจ";
$a[72]="ร้านขนมจีนหน้าสวน";
$a[73]="คุณสมจิตร์  มีลาภ";
$a[74]="ร้านชาบูขาวเเดง";
$a[75]="ส้มตำก้ะฉ้ะ";
$a[76]="บึงหลวง เก็บหวัน";
$a[77]="แสงตะวัน";
$a[78]="กินเพลิน";
$a[79]="อองตอง เฮ้าส์";
$a[80]="SEAFOOD by เปี๊ยกโกปี๊";
$a[81]="ข้าวขาหมูลุงภาพ";
$a[82]="ร้าน ก๋วยเตี๋ยวเรือในตำนาน";
$a[83]="ร้านขนมจีนนคร";
$a[84]="ข้วแกงฅนคอน";
$a[85]="ร้านสถานีแซ่บ";
$a[86]="ซ้อ7ก๊วยเตี๋ยวต้มยำรสเด็ด";
$a[87]="นายวิทวัส ศากะพันธ์";
$a[88]="ซีบาร์ ชาบู บุฟเฟ่แกรนด์";
$a[89]="ก๋วยเตี๋ยวเรือหมูน้ำตก";
$a[90]="ร้านบ้านปู";
$a[91]="ถนัดย่าง";
$a[92]="โสเจ๊งเล้งแซ่บ";
$a[93]="ไอ ด็อจ บาร์ 90";
$a[94]="ร้านใบตองอาหารบ้านๆ";
$a[95]="ขนมจีนแม่ญา";
$a[96]="คุณลราน ฉอสันเที่ยะ";
$a[97]="ข้าวต้มยันหวางคาราโอเกะ";
$a[98]="ร้าน 3จ.";
$a[99]="ส้มตำยำแซ่บ";
$a[100]="ครัวรสเมย์";
$a[101]="ร้านส้มตำสุดา";
$a[102]="จิราภา  กริ่งกาญจนา";
$a[103]="ก๋วยเตี๋ยวเรือกะลา";
$a[104]="ร้านขนมจีนบุฟเฟ่ต์  59";
$a[105]="ร้านชาบู mix";
$a[106]="กำพล วงษ์ระบิลนาม";
$a[107]="หม้อแตก ทะเลเดือด";
$a[108]="บ้านตีหม้อ เคาะกระทะ";
$a[109]="ร้านเถ้าแก่";
$a[110]="บ้านเพลงไพร";
$a[111]="ข้าวขาหมูเจ้นิด";
$a[112]="ป้าเอียด";
$a[113]="Ornaji";
$a[114]="น้าแมวข้าวแกงปักษ์ใต้";
$a[115]="ร้านอาหาร วิลาคระฆังทอง";
$a[116]="ร้านกาแฟคนทำกิน";
$a[117]="ก๋วยเตี๋ยวเรือนารา";
$a[118]="เตี๋ยวเรือแซ่บเวอร์";
$a[119]="ศูนย์อาหารอิสลามสถานีรถไฟ";
$a[120]="ร้านก๋วยเตี๋ยวเรือโอฬาร";
$a[121]="อีสานบ้านพรุตำนัว";
$a[122]="คุณประนอม  มีศรี";
$a[123]="ร้านก๋วยเตี๋ยวต้มยำน้ำใส่";
$a[124]="ร้านเย็นตาโฟเจ้เพชร";
$a[125]="กับแกล้มกับข้าว";
$a[126]="ร้าน ณ. ตำนานไม้ 62";
$a[127]="คุณสุดา ชูบุญศรี";
$a[128]="stock  house";
$a[129]="ก๊วยเตี๋ยวพิษณุโลกสาขา5";
$a[130]="กระบี่ซีฟู๊ด";
$a[131]="อดัม ติ่มซำ ฮาลาล";
$a[132]="stock  house";
$a[133]="ชายสี่";
$a[134]="ข้าวขาหมู-กระเพาะปลา";
$a[135]="สามชัยโต้รุ่ง";
$a[136]="วรากร (ข้าวมันไก่แซ่บ)";
$a[137]="ร้านครัวแอ๋มพิมพ์";
$a[138]="Chichen Fly By Dr.Fah";
$a[139]="เจี๊ยบอุดร";
$a[140]="ครัวตั้งต้น";
$a[141]="กรรณิการ์อร ดีโพธ์";
$a[142]="ปิ้ง-ย่าง  เจงกีสข่าน";
$a[143]="เอาดี้ย์ เมี่ยงปลาเผา";
$a[144]="ข้าวมันไก่ลุงอ้วน";
$a[145]="@1234 แก้มลิงคับ";
$a[146]="ร้าน ข้าวขาหมูอาม่า";
$a[147]="นาย อภิชัย แฮงศรี";
$a[148]="เตี๋ยวไก่ไมโลแม่ศรีนวล";
$a[149]="ร้านป้าพิศ";
$a[150]="ราดหน้าหมูเด้ง สิทธิทร์เจริญ";
$a[151]="คลาสสิคบาร์";
$a[152]="ร้านลูกแฝด น้ำจิ้มรสแด็ด";
$a[153]="ร้านบุหาฟาฏอนีโภชนา";
$a[154]="ร้านไก่ทอดจิรานันต์";
$a[155]="ผัดไทยใบตอง";
$a[156]="Al Mahamod Restaurant";
$a[157]="ครัวนางพญา";
$a[158]="ร้านวิถีไทย";
$a[159]="พี่อุ้ยร้านอาหารหน้ามัสยิด";
$a[160]="แต่เตี้ยมเบตง";
$a[161]="ร้านลาบคลองเปล";
$a[162]="Black sheep";
$a[163]="V  Box Cafe";
$a[164]="คุณปฐมาวดี เนียมชุม";
$a[165]="ร้านข้าวมันไก่เหมยฟ้า";
$a[166]="ร้านอาหารตามสั่งรวมมิตรบ้านพรุ";
$a[167]="ลาบนัว";
$a[168]="เรื่องบลเตา";
$a[169]="ร้านพี่เอียด";
$a[170]="แซ่บนัว แหนมเนืองอุดร สาขาโลตัส";
$a[171]="ร้านเกาเหลาข้าวสวย";
$a[172]="ขนมจีนเมืองลุง";
$a[173]="ก๊วยเตี๋ยวเรือลุงรูญ";
$a[174]="ป้าเล็กขนมจีนเมืองคอน";
$a[175]="ก๋วยจั๊บไก่ตุ๋นยาจีนลุงสิทธิ์";
$a[176]="ร้านเรือนศิลป์";
$a[177]="น้ำตกอ่าวนาง";
$a[178]="ครัวควนลัง";
$a[179]="ก๋วยเตี๋ยวเรือเป็นต่อ";
$a[180]="อีสานชวนชิม";
$a[181]="ร้านศิริพรโภชนา";
$a[182]="ร้าน๑๐๐ บุฟผา อาหารไทย";
$a[183]="บ้านสวนพรนับพัน";
$a[184]="ร้านหมูไบร์ก้อนโต";
$a[185]="ข้าวมันไก่เบตง";
$a[186]="ร้านเพิ่มทรัพย์";
$a[187]="ร้านเผ็ดอีสาน";
$a[188]="แสงศรีติ่มซำคำโต";
$a[189]="คุณสุนทร";
$a[190]="ตำคันทรี";
$a[191]="ครัวม๊ะร่อ";
$a[192]="ร้านก๋วยเตี๋ยวอัยย๊ะ หรอยจัง";
$a[193]="ป้านีอาหารตามสั่ง";
$a[194]="คุณอำไพ  ส่งเสริม";
$a[195]="ครัวคุณติ่ว";
$a[196]="ร้านป้าภา";
$a[197]="ครัวอิสลาม";
$a[198]="คุณหนิง";
$a[199]="รัตนา  ปินคำ";
$a[200]="เวณิจณ์ษรา ศิริวัฒน์";
$a[201]="เตอร์อีสานแซบ";
$a[202]="ร้านข้าวถาดยักษ์";
$a[203]="ก๋วยเตี๋ยวต้มยำในชอย";
$a[204]="ก๋วยเตี๋ยวจัมโบ้";
$a[205]="คุณ จักรวาล พวงบุญ";
$a[206]="ข้าวหมกไก่ฮัจยยี่ยูโซ๊ป";
$a[207]="ร้านอาหารอิสลาม  ฟาริดา";
$a[208]="ดงบัง";
$a[209]="ร้านแซบลาบอุดร";
$a[210]="ก๋วยเตี๋ยวไก่ตุ๋น";
$a[211]="ครัวปักษ์หลัก";
$a[212]="เจ๊ภา";
$a[213]="ก๋วยเตี๋ยวปลาตอด";
$a[214]="ข้าวแกงแม่จำปา";
$a[215]="Seijisusushihatyai";
$a[216]="ปกรณ์  แก้วสูงสุด";
$a[217]="โก้ชีพอาหารตามสั่ง";
$a[218]="ร้านก๋วยเตี๋ยวบิ๊กปู";
$a[219]="หจก. มิสเตอร์ สเต็ก";
$a[220]="Tigerpig cafe & coffee";
$a[221]="Koji  chu";
$a[222]="ข้าวแกงพี่ไก่";
$a[223]="พามาข้าวแกง";
$a[224]="ร้านตอง 7";
$a[225]="ร้านตัวเติ๊ดเติ้ด";
$a[226]="ข้าวแกงเด็กแนว";
$a[227]="เตี๋ยวเรือป้าแต๋ว";
$a[228]="นางวันทนีย์ ประยูรชาติ";
$a[229]="ร้านสังกะสี";
$a[230]="น้องนุ่นข้าวแกง";
$a[231]="เตี๋ยวยิ้ม ต้มยำ";
$a[232]="ร้านขวัญข้าว";
$a[233]="ร้านเจ้ก้อย ซ9";
$a[234]="ร้านเเซ่บนัว  หนองคาย";
$a[235]="นาเนียสเต๊ก เขต8";
$a[236]="ครัวฮาลาลฟู๊ด";
$a[237]="จะกินอย่าบ่น";
$a[238]="ก๋วยเตี๋ยวเรือโกตุ๋ย";
$a[239]="ข้าวแกงน้องไอดิน";
$a[240]="ร้านสเต็กเด็กแนว";
$a[241]="ร้านโกหอมข้าวหมูแดงโบราณ สาขา3";
$a[242]="คุณ ล้ดดาวัลย์มีสน";
$a[243]="คุณปิยาภรณ์  ฉิมสนิท";
$a[244]="ส้มตำป้านุช";
$a[245]="ครัวริมสวน";
$a[246]="ณ.114 คิดถึงเสมอ";
$a[247]="กัลยวรรธน์ พันธุ์เรือง";
$a[248]="ร้านอาหาร คาเมรอน";
$a[249]="คุณจิรายุ  ศิริวงศ์โสทร";
$a[250]="นางสาวภิตินันท์  สุนทรากร";
$a[251]="คุณตวงพร  ทองลิ่ม";
$a[252]="ครัวป้าปูอาหารตามสั่ง";
$a[253]="4จ.พาณิชย์";
$a[254]="ร้านส้มตำ เป็ดย่าง คูเมือง";
$a[255]="ร้านครูหวน";
$a[256]="ครัวพริกไท";
$a[257]="มากิน-มากัน";
$a[258]="The Hopster Cafe'";
$a[259]="ข้าวแกงป้าหงวน";
$a[260]="ร้านชริม สยาม";
$a[261]="ข้าวมันไก่นายหัว";
$a[262]="ข้าวแกงเมืองลุง สาขา2 น้อยจอย";
$a[263]="ก๋วยเตี๋ยวเรือเต็งหนึ่ง";
$a[264]="ร้านข้าวหมูแดง-หมูกรอบทองสำเร็จ";
$a[265]="ครัวบ้านนอก";
$a[266]="พ.ต.ผิน เอมเอก";
$a[267]="ร้านเตียวbyมาดามฝน";
$a[268]="คลองแซ่บ";
$a[269]="ก๋วยเตี๋ยวเรือพี่พิศ";
$a[270]="ร้านก๋วยเตี๋ยวป้าอ้วน";
$a[271]="กะเพราถาดยักษ์";
$a[272]="ร้านอาหาร99";
$a[273]="Baby Coffee";
$a[274]="คุณฐิติกร วิไลรัตน์";
$a[275]="ร้าน MAMEE ฮาลาลฟู๊ด";
$a[276]="พี่แอนหมี่เกี๊ยว";
$a[277]="แวนะ  แวหะมะ";
$a[278]="ก๋วยเตี๋ยวเรือหลานตาเพียร";
$a[279]="คุณทวีศักดิ์ เบ็ญจวรพจน์";
$a[280]="ก๋วยเตี๋ยวนายโย่ง";
$a[281]="เอี่ยวเฮง ก๋วยเตี๋ยวไก่ตุ๋น";
$a[282]="ก๋วยเตี๋ยวดู๋ดี๋ เติมวันนงเยาว์";
$a[283]="คุณเสน่ห์  ขวัญเย็น";
$a[284]="คุณรุ่งฤดี  หลีสกูล";
$a[285]="ครัวเฮียปุ๊ย";
$a[286]="ไอแอม ก๋วยเตี๋ยวเรือ";
$a[287]="เรนโบว์ คาเฟ่";
$a[288]="ก๋วยเตี๋ยวต้มยำมันกุ้ง (ฮาลา)";
$a[289]="ร้านโกเด้งบ้านพรุ";
$a[290]="ร้านโกหอม";
$a[291]="เล้งแซ่บลุงหมู";
$a[292]="ร้านสามเกลอ เล้งต้มแซ่บ";
$a[293]="ข้าวมันไก่ ราดหน้า ทุ่งรี";
$a[294]="วาฬยิ้มกินนม";
$a[295]="ก๋วยเตี๋ยวหางหมู สาขา2";
$a[296]="โกเกี๋ยง";
$a[297]="เอกเขนก";
$a[298]="ผัดไทยในอู่";
$a[299]="ก๋วยเตี๋ยวผักหวาน";
$a[300]="คนรักท้องถิ่น คนกินของหรอย";
$a[301]="ห้องปกครอง";
$a[302]="44  ปิ้งย่าง";
$a[303]="ข้าวสตู";
$a[304]="ร้านข้าวแกงมะยม";
$a[305]="ติดลม";
$a[306]="Route 108 สาขา 2";
$a[307]="ร้านอาหารทะเลเผาและตามสั่งเรินเรา";
$a[308]="ครัวโกดำอาหารอีสาน";
$a[309]="บริษัท มาสเตอร์พีซ โฮเต็ล กรุ๊ป จำกัด";
$a[310]="ร้านแกงใต้";
$a[311]="ฮ.นกฮูก";
$a[312]="ร้านป๋าโส ลาบเป็ด";
$a[313]="ร้านหลบมุม(บ้านเขากลอย)";
$a[314]="มะลิจัง";
$a[315]="ร้านครัวฅนเหนือเขต8";
$a[316]="ร้านข้าวตำรับคุณแม่";
$a[317]="หอมซัง@ท่าข้าม";
$a[318]="ครัวจิ้มจุ๋ม";
$a[319]="บริษัท เอเชีย เพอเฟค แมเนจเม้นท์ จำกัด";
$a[320]="บริษัท โทนิกซ์ ออแกไนเซอร์ จำกัด";
$a[321]="เปิดหม้อเด้ง สาขา 2 หาดใหญ่";
$a[322]="ร้านอร่อยเหาะ";
$a[323]="ส้มตำถาด";
$a[324]="อิ่มเอม";
$a[325]="ขนมจีนลุงไข่ปากพนัง";
$a[326]="ขนมจีนยายพัน";
$a[327]="ตำหรับยาย";
$a[328]="คุณชุติมา  รัตนะ";
$a[329]="ครัวฟิวฉัน  SlNCE2562";
$a[330]="Up to me";
$a[331]="ร้านเก้าโภชนา";
$a[332]="ร้านครัวต้นท้อน";
$a[333]="ร้านกว้องจั่น";
$a[334]="หน้าใหญ่ไก่ทอด ไต้หวัน";
$a[335]="คุณชุติมา  รัตนะ";
$a[336]="ลาบนัว";
$a[337]="ครัวเจ๊หนิง";
$a[338]="โกเก้า ข้าวมันไก่";
$a[339]="เล้ง Super แซ่บ สาขาหาดใหญ่";
$a[340]="ร้านพี่พร";
$a[341]="ร้านต่อยอด";
$a[342]="ร้านพี่พร";
$a[343]="ร้านต่อยอด";
$a[344]="ขนมจีนเจ๊เดือน";
$a[345]="ร้านมีตางค์ติ๋มซำ";
$a[346]="ป้าน้อยโต้รุ่ง (ศูนย์อาหารโต้รุ่งฉือฉาง)";
$a[347]="เจ้าสัว ติมซำ";
$a[348]="MT เกาเหลาเลือดหมู";
$a[349]="ร้านข้างแกงพี่ลัย";
$a[350]="แบร์กริสปิ้งย่างหาดใหญ่";
$a[351]="คุณอารมย์  ศรีอยู่สุข";
$a[352]="The mine bistro";
$a[353]="ร้านจิ๊กโก๋ CounTry";
$a[354]="ครัวน้องสาวM";
$a[355]="ครัวแม่วันทนา";
$a[356]="คุณนรภัทร์  จันทร์เพริศพราย";
$a[357]="ร้านพิศติมซำ";
$a[358]="ร้านเจ้านาย";
$a[359]="ร้านข้าวต้มเซ้าซี";
$a[360]="บังอัฟฏ็อล";
$a[361]="ครัวริมสวน";
$a[362]="ครัวยายจิต";
$a[363]="เล้ง by มดเอ็กซ์";
$a[364]="ร้านข้าวแกงป้านิ่ม";
$a[365]="คุณบังอรศรี โพธิ์ทอง";
$a[366]="คุณพิพรรษพร  มากมูล";
$a[367]="ร้านนมัสเต";
$a[368]="เจ้ไหมเย็นตาโฟ สาขา2";
$a[369]="คุณกุลชญา เพชรมุณี";
$a[370]="OLD CASTLE (ข้าวแกง อาหารตามสั่ง)";
$a[371]="คุณแสงเดือน ขุนรัตนเวทย์";
$a[372]="ครัวตะลุง";
$a[373]="ก๋วยเตี๋ยวเรืออยุธยา";
$a[374]="Xis";
$a[375]="ร้านท่าเหรียง";
$a[376]="ร้านบังหลงเย็นตาโฟทะเล";
$a[377]="Pam corner";
$a[378]="ก๋วยเตี๋ยวโอฬาร สาขา 8";
$a[379]="ก๋วยจั๊บ คนแซ่แต้";
$a[380]="พัชรียา มานพภาพ";
$a[381]="ร้านเฝอแซ่บ Factory";
$a[382]="Sixteen house Shabu & Steak";
$a[383]="เหม่ย เหว่ย";
$a[384]="ร้านหม่าล่า ฉือฉาง";
$a[385]="ต่อยอด";
$a[386]="กล้วยสแตมป์";
$a[387]="ก๋วยเตี๋ยวเรือ ณ.คอน";
$a[388]="ครัวเบญจวรรณ2";
$a[389]="นกเขา";
$a[390]="โอมิ ซูชิ แอน เทปปัน";
$a[391]="สุนีย์ เส็นหมาน";
$a[392]="อาหลาน";
$a[393]="อิ่มพุง";
$a[394]="เพชร ข้าวแกงบุฟเฟ่ต์";
$a[395]="สวนตาจวง";
$a[396]="Sea ซีฟู๊ด ทะเลเผา";
$a[397]="ลูกแก้วคาเฟ่ สาขา2";
$a[398]="ไอแอมเป็ด";
$a[399]="เรือนเตี๋ยวเรือ (ข้าง ม.หาดใหญ่)";
$a[400]="คุณอานนท์ เสรีรักษ์";
$a[401]="อิ่มอร่อย";
$a[402]="ก๋วยเตี๋ยวชากังราว";
$a[403]="คุณจเร ธรรวาโร";
$a[404]="เตี๋ยวตุ๋น หม้อไฟ";
$a[405]="Family ชาบู";
$a[406]="คุณยุภาวดี บิลหมาน";
$a[407]="เบียร์วุ้น";
$a[408]="ลูกสิทธิ์";
$a[409]="นามู";
$a[410]="กูไทยนู๊ดเดิ้ลคาเฟ่";
$a[411]="คุณจันทิมา ปานะบุตร";
$a[412]="แทนทำก๋วยเตี๋ยวปลา";
$a[413]="ร้านน้องเบลล์";
$a[414]="ก๋วยเตี๋ยวมือสอง";
$a[415]="โกเบนซ์ ซี่โครงเมตร";
$a[416]="สำเภาทอง";
$a[417]="พี่แดง";
$a[418]="คุณสุชาติ ทองญาน";
$a[419]="คุณเนตนภา มูเก็บ";
$a[420]="ป้ามร";
$a[421]="ซุป แซ่บ มัสยิด เกาะหมี";
$a[422]="ทราย";
$a[423]="ครัวพี่สุ";
$a[424]="มุงจาก";
$a[425]="ครัวต้นไผ่";
$a[426]="คุณอรสา อำคำ";
$a[427]="ครัวไซร่า";
$a[428]="กินตามยัง";
$a[429]="ครัวบ้านตั้ม";
$a[430]="ร้านครัวมุสสลิม";
$a[431]="ร้านแซ่บอีสาน (หัวรั้ว)";
$a[432]="รสมือแม่";
$a[433]="ครัวลมุล";
$a[434]="คุณจตุรงค์ วรกิจ";
$a[435]="เคลิ้มชาบูหาดใหญ่";
$a[436]="อิ่มเย็น";
$a[437]="ข้าวแกงพี่ไก่ และอาหารตามสั่ง";
$a[438]="Pam(อาหารและเครื่องดื่ม)";
$a[439]="พี่รมย์ อาหารตามสั่ง";
$a[440]="ร้านเราราดหน้าซุปเปอร์ศิษย์ล่อคุ้งก";
$a[441]="โต๊ะกับข้าว";
$a[442]="บ้านเปี่ยมบะหมี่เกี๊ยวกุ้ง";
$a[443]="ส้มตำพี่เมือง";
$a[444]="ร้านครัวครูสัน ปลาเผา";
$a[445]="ร้านอุมิ";
$a[446]="โกหวัดกระเพราเป็ด";
$a[447]="ก้องผัดไทย";
$a[448]="แม่พร ก๋วยเตี๋ยวไก่โบราณ";
$a[449]="นัวส์";
$a[450]="บิงซูชิ (Bing Su Shi)";
$a[451]="สุขใจ";
$a[452]="คุณภูริณัฐ ผลกอบกุล";
$a[453]="หาดใหญ่หมูกะทะ";
$a[454]="คุณสมพร ชินเดชชุสิน";
$a[455]="เอี่ยนหมูตุ๋น";
$a[456]="บริษัท ฮาบีฟ จำกัด";
$a[457]="ก๋วยเตี๋ยวท้าพิสูจน์";
$a[458]="คุณธนพร มีบุญ";
$a[459]="คุณกรแก้ว ถาวร";
$a[460]="สวนอาหารกรกช";
$a[461]="นู๊ดเดิ้ลแซ่บ";
$a[462]="ร้านป้าเอียด โกแว่น";
$a[463]="ร้านก๋วยเตี๋ยวเรือซากีรีน";
$a[464]="ครัวโอ่งไม้";
$a[465]="ตั้งต้น หมูทอด";
$a[466]="คันไถนายเขื่อน";
$a[467]="สมาน พาณิชกุล";
$a[468]="คุณสมคิด";
$a[469]="ร้านดูด";
$a[470]="ครัวบ้านสวน";
$a[471]="ครัวกันเอง";
$a[472]="บะหมี่กุ้งหนานหยวน";
$a[473]="คุณอลิสา ทองไกร";
$a[474]="ครัวครูสรรค์";
$a[475]="บุษบาเรือนแพ";
$a[476]="สเต็กไฟแดง";
$a[477]="ครัวลุงถาวร อาหารตามสั่ง";
$a[478]="345 ก๋วยเตี๋ยวเรือ";
$a[479]="ลูกชิ้นถนัดศรี2";
$a[480]="ครัวลุงดำ";
$a[481]="ครัวมะเรือง";
$a[482]="ข้าวมันไก่โกหย่ง";
$a[483]="ร้านอาหารเดิมเดิม";
$a[484]="ไก่ทอดเดชา (สาขาสนามบิน)";
$a[485]="บริษัท หนานหยวน นู๊ดเดิ้ล จำกัด";
$a[486]="ข้าวมันไก่เมียเก่า";
$a[487]="ร้านขุมทองครัวไทย";
$a[488]="เนินขุมทองกาเดนส์";
$a[489]="นายแดง บะกุ๊ดเต๋";
$a[490]="กระท่อมลุงบอย";
$a[491]="ร้านสาวจันทร์";
$a[492]="ร้านหรอย";
$a[493]="แก่นนครอีสาน";
$a[494]="ร้านไทรทอง";
$a[495]="ร้านครัวไท";
$a[496]="ตังเกซีฟู้ด";
$a[497]="สเต็กเป็นไทสาขา3";
$a[498]="ร้านเช็คอิ่ม";
$a[499]="ชายสี่บะหมี่เกี๊ยว";
$a[500]="ข้าวแกงแดนใต้";
$a[501]="ร้านขนำคุณนาย";
$a[502]="ก๋วยเตี๋ยวเจ๊แกละ";
$a[503]="ข้าวมันไก่เจมส์ 2";
$a[504]="โกบิ๊ก";
$a[505]="ร้านลักกี้";
$a[506]="ร้านโกหม่ำ";
$a[507]="ร้านครัวลุงบูลย์ตาชั่งอีสานใต้";
$a[508]="ร้านข้าวแกงละออ";
$a[509]="ร้านพี่เอียด";
$a[510]="ร้านข้าวหมูแดงทรงเครื่อง";
$a[511]="ร้านตาชั่งอีสานใต้";
$a[512]="หจก.ต้นทาง";
$a[513]="ร้านก๋วยเตี๋ยวเรือต่อชาม";
$a[514]="ร้านบ้านสลัด";
$a[515]="คุณสายสมร";
$a[516]="ร้านข้าวสตู";
$a[517]="ข้าวเเกงศาลาพักใจ";
$a[518]="คุณอากาฉ๊ะ มูเก็ม";
$a[519]="ครัวต้นไผ่ (พี่หมวย)";
$a[520]="40 ก๋วยจั๊บ";
$a[521]="เจ๊หญิงข้าวมันไก่";
$a[522]="ร้านพี่นาตอาหารตามสั่ง";
$a[523]="ข้าวต้มหัวโค้ง";
$a[524]="ข้าวขาหมูอินเตอร์";
$a[525]="ลูกคนตรัง ผัดไทอาหารตามสั่ง";
$a[526]="กุ๊กอ๊อด";
$a[527]="ร้านส้มตำชิด-ชล";
$a[528]="ก๋วยเตี๋ยวเรือในสวน";
$a[529]="เจี๊ยบครัวนคร";
$a[530]="ข้าวมันไก่";
$a[531]="ก๋วยเตี๋ยวเรือ ครูหมู รสเด็ด";
$a[532]="333 คาราโอเกะ";
$a[533]="โกตั๊ก";
$a[534]="ร้านใบเฟิร์น";
$a[535]="ก๋วยเตี๋ยวลุงชาชักธง";
$a[536]="ร้านธัญทิพ";
$a[537]="ข้าวมันไก่เจ๊ตา";
$a[538]="ร้านส้มตำพี่แอม";
$a[539]="ร้านนายตู้";
$a[540]="ร้านเสกเนื้อเปื่อย";
$a[541]="ข้าวแกงคนคอน ขนมจีนหม้อดิน";
$a[542]="คุณวิวิ ก๋วยเตี๋ยวเรือเมย์";
$a[543]="ร้านอาหารโกบ่าว";
$a[544]="ครัวไข่ทอง";
$a[545]="คุณแจก นวลเพ็ง";
$a[546]="ก๋วยเตี๋ยวช้าง";
$a[547]="ร้านน้ำชาเจ๊เอียด";
$a[548]="ป้าแอ๋ว";
$a[549]="ก๋วยเตี๋ยวลุงหงบ";
$a[550]="ปลาร้าหอมแม่มะลิ";
$a[551]="ครัวพรชื่น";
$a[552]="แม่อุไร";
$a[553]="ร้านก๋วยเตี๋ยวเรือแม่พร";
$a[554]="ร้านข้าวแกงพี่อ้อย";
$a[555]="ร้านก๋วยเตี๋ยวเรืออยุธยา";
$a[556]="ร้านข้าวหมูแดงป้าณี";
$a[557]="เย็นตาโฟรสเด็ด";
$a[558]="ก๋วยเตี๋ยวเรือ อาหารตามสั่ง";
$a[559]="ร้านข้าวมันไก่ โก-ลก";
$a[560]="คุณนิตยา ชูมี";
$a[561]="ร้านเดฟเย็นตาโฟ";
$a[562]="ร้านซุ้มข้าวยำ";
$a[563]="ร้านข้าวแกงบ้านพรุ(เจ้าเก่า)";
$a[564]="ร้านบุษบาข้าวแกง";
$a[565]="ร้านมุมสบาย";
$a[566]="ราดหน้าราโด้บ้านพรุ";
$a[567]="เจ๊โสอาหารตามสั่ง";
$a[568]="ร้านเมืองเอก";
$a[569]="ประภาส ศรีสนิท";
$a[570]="ร้านส้มตำแซ่บเวอร์";
$a[571]="บจก.โกไศยกานนท์ (Paddington Station";
$a[572]="ร้านเย็นตาโฟรสเด็ด";
$a[573]="น้องลักษข้าวแกง";
$a[574]="ร้านอาหารทุ่งเค็ด";
$a[575]="โกอ้วน";
$a[576]="ร้านป้าฝ้า";
$a[577]="ร้านปอฝ้าย";
$a[578]="ร้านก๋วยเตี๊ยวคลองแงะ";
$a[579]="ร้านน้องหมวยข้าวขาหมู";
$a[580]="คุณบุญญธิดา อยู่มากญาติ";
$a[581]="ร้านข้าวต้มเปียก";
$a[582]="ครัวทิพย์";
$a[583]="ร้านป้าพร";
$a[584]="ร้านน้องเฟริสแซ่บเวอร์";
$a[585]="ร้านยินดีข้าวต้มโต้รุ่ง";
$a[586]="ร้านปลาดุกย่าง";
$a[587]="คุณปรีชา มุสิกะไชย";
$a[588]="ชายสี่ บะหมี่เกี๊ยว";
$a[589]="คุณสมบูรณ์ แซ่ว่อง";
$a[590]="ร้านก๋วยเตี๊ยวช้าง";
$a[591]="ไก่อบน้ำผึ้ง คุณนงลักษณ์ ทองฉัตร";
$a[592]="ร้านข้าวต้มบ้านพรุ";
$a[593]="สเต็กจ๋า";
$a[594]="เพื่อนเกลอ";
$a[595]="ร้านก๋วยเตี๋ยวหัวโค้ง";
$a[596]="ร้านป้าแวว";
$a[597]="ร้านพี่ต้อยจานด่วน";
$a[598]="ครัวไม้ป่า";
$a[599]="ร้านใบตอง ต้มแซ่บ";
$a[600]="ป้านาอาหารตามสั่ง";
$a[601]="ร้านครัวเจ้านาย";
$a[602]="บ้านกินเส้น";
$a[603]="ป้าจูล";
$a[604]="ขาหมูลุงนนท์";
$a[605]="เจ๊แดง เย็นตาโฟ";
$a[606]="คุณเจริญพร ชีวรัชชานนท์";
$a[607]="ร้านอีสานกาญจนา";
$a[608]="ชาบู ปิ้งย่าง โกตี๋";
$a[609]="ร้านบ้านครอบครัว";
$a[610]="โรสบะหมี่เกี๊ยว";
$a[611]="คุณเพ็ญพักตร์ ปัญญาธนกร";
$a[612]="ก๊ะนุ้ย";
$a[613]="บ้านเขาใน อาหารพื้นบ้าน";
$a[614]="คุณสายโสดา สวัสศรี";
$a[615]="คุณก๊ะเซ๊าะ";
$a[616]="สมพร เลียกะเติบ";
$a[617]="คุณประภาศิริ ชัยชนะสงคราม";
$a[618]="คุณพะ หลีเบ็ญสะ";
$a[619]="ร้านเขลางศ์";
$a[620]="ร้านอิสลามมุงจาก";
$a[621]="ก๋วยเตี๋ยวเรือ";
$a[622]="FINBAR&BISTRO";
$a[623]="เจ๊ไรอาหารตามสั่ง";
$a[624]="คุณนิยม บุญวรรณโณ";
$a[625]="บ้านยรรโฟล้ค";
$a[626]="ร้านโกจ้อง";
$a[627]="ลีลาตามสั่ง";
$a[628]="เบียร์ แอนด์ ไอ";
$a[629]="ข้าวขาหมู";
$a[630]="พี่วิสิทธิ์";
$a[631]="ร้านครัวนิตา";
$a[632]="คุณกรองกาญน์ พัฒโน";
$a[633]="คุณวรรณี เกื้อช่วย";
$a[634]="ร้านเจ้ดา อาหารตามสั่ง";
$a[635]="เจี๊นบโภชนา อาหารตามสั่ง";
$a[636]="ร้านบ่อปลาวังมัจฉา";
$a[637]="ร้านข้าวแกงเมืองตรัง";
$a[638]="ร้านวรรณส้มตำ";
$a[639]="ร้านครัวคุณเป็ด";
$a[640]="คุณจิราวรรณ น้ำรอบ";
$a[641]="ร้านอาหาร แกรนด์ลาซีส";
$a[642]="คุณถาวร เรืองชัย";
$a[643]="คุณเพ็ญทิพา เตโชชะ";
$a[644]="ครัวโพธิ์ทอง";
$a[645]="ส้มตำชัยภูมิ";
$a[646]="ครัวอีสานใต้";
$a[647]="ร้านโกกิม อาหารเช้า";
$a[648]="หนานหยวนเกี๊ยวกุ้ง";
$a[649]="ครัวในสวน";
$a[650]="ก๋วยเตี๋ยวเรือคลองชล";
$a[651]="ข้าวแกงปักใต้";
$a[652]="ทำหรอย ตามสั่ง";
$a[653]="คุณหม๊ะ สันเบ็ญโส๊ะ";
$a[654]="ร้านป้านุ้ย";
$a[655]="คุณชิต ชมสุวรรณ";
$a[656]="คุณสมพร นวลบุญ";
$a[657]="ร้านเคยร่อน";
$a[658]="ร้านเจ๊ะอุ๊ข้าวมันไก่";
$a[659]="รุ่งอยุธยา ก๋วยเตี๋ยวน้ำตก";
$a[660]="ข้าวแกงคอพาน";
$a[661]="ร้าน Hatyai ซาซิมิ";
$a[662]="ร้านหว่าหวา ซูชิ";
$a[663]="ร้านส้มตำป้าติ่ว";
$a[664]="ร้านข้าวแกงเจ้เอ๋";
$a[665]="ร้านตาชั่งอีสาน (ท่าเคียน)";
$a[666]="ร้านอาหารป้าเพ็ญ";
$a[667]="ร้านส้มตำป้าเพชร";
$a[668]="Bananasteak";
$a[669]="คุณชนายุส ชัยวนนท์";
$a[670]="ก๋วยเตี๋ยวเรือหมูน้ำตก";
$a[671]="ร้านต๋อมโภชนา";
$a[672]="เปิ้ล ปลาเผาสมุนไพร";
$a[673]="ร้านตามสั่งจ่า";
$a[674]="ป้ารัตน์";
$a[675]="ร้านเฮียฮอก";
$a[676]="ร้านแซบอีหลี";
$a[677]="ร้านน้องแอน";
$a[678]="ร้านครัว ส.น.";
$a[679]="ร้านพลพิชัยการค้า";
$a[680]="คุณหมวย แซ่ลิ่ม";
$a[681]="ร้านข้าวแกงป้าไพ";
$a[682]="สุดสาย 1";
$a[683]="ราดหน้าราษฎร์อุทิศ";
$a[684]="ร้านหมูกรอบฮ่องเต้สาขา2";
$a[685]="ร้านข้าวมันไก่เฮียแว่น";
$a[686]="ร้านลุงภู ข้าวขาหมู";
$a[687]="ร้านต้นหอม";
$a[688]="ร้านพี่น้อง";
$a[689]="iร้านอาหารตามสั่ง";
$a[690]="ญิ๋งฝ้ายรสนัวร์";
$a[691]="แม่เบญ2";
$a[692]="ครัวคาเพ้นเตอร์";
$a[693]="อามัส";
$a[694]="แม่เบญ ปลาเผา";
$a[695]="ร้านก๋วยเตียวเฮียอ้วน";
$a[696]="ร้านโกปุ้ย";
$a[697]="ร้านกัปตัน";
$a[698]="ร้านนิ่มก๋วยเตี๋ยว";
$a[699]="ร้าน ข้าวแกงอิสลามเมืองตรัง 2";
$a[700]="ร้านมาลัยเย็นตาโฟ";
$a[701]="ร้านไพลินสเต็กเฮ้าส์";
$a[702]="คุณประภัทร์ มณีสว่าง";
$a[703]="คุณอำพันธ์ ศรีรักษ์";
$a[704]="ร้านอรข้าวหมูแดง";
$a[705]="คุณอำพล พุ่มทองคำ";
$a[706]="คุณยงยุทธ โรจน์กฤษวิทยา";
$a[707]="ข้าวแกงปักษ์ใต้";
$a[708]="ร้าน ครัวแม่พร";
$a[709]="อิ่มอร่อย ตามสั่ง";
$a[710]="ริสกีรีน่า";
$a[711]="ก๋วยเตี๋ยวไก่ตุ๋นคุณปลา";
$a[712]="เอี่ยวเฮง ซุปเปอร์หมูตุ๋นหม้อไฟ";
$a[713]="โปรดใจขนมจีนเส้นสด";
$a[714]="คุณสาสุนีย์ พีระประสมพงษ์";
$a[715]="Canton SUKI";
$a[716]="The Supper by คุณป้า";
$a[717]="ร้านอิ่มอร่อย (ป.ณัฐพล)";
$a[718]="โชคดีแต่เตี้ยม";
$a[719]="ก๋วยเตี๋ยวกูฟู";
$a[720]="ก๋วยเตี๋ยวแซบเวอร์";
$a[721]="แหลมโพธิ์โภชนา";
$a[722]="ข้าวแกงนครศรี";
$a[723]="ข้าวต้มอั้งม้อ";
$a[724]="ข้าวแกงป้าบัติ";
$a[725]="ราดหน้าราโด้";
$a[726]="ข้าวขาหมู";
$a[727]="ร้านอาหารโกชัย";
$a[728]="ครัวปะหยัด";
$a[729]="ผัดไทยกุ้งสดไทยอาคาร";
$a[730]="คุณวีณา ฉายารจิตรพงษ์";
$a[731]="โกโย้งโภชนา";
$a[732]="รีานสุดยอดอีสาน";
$a[733]="ร้านกุ๊กเปี๊ยก";
$a[734]="ร้านครัวป้าฟืน";
$a[735]="ลุงแอร์ ป้าศรี อาหารเหนือ";
$a[736]="ป้ามาลี";
$a[737]="ร้านก๋วยเตี๋ยวอีสาน";
$a[738]="ส้มตำคอหมูย่างเจ๊ฟอง";
$a[739]="ร้านส้มตำพี่ปู";
$a[740]="ป้าคำชวนชิม";
$a[741]="คุณสุนีย์ แซ่จู";
$a[742]="ร้านกุ๊กโต้ง 2";
$a[743]="ร้านข้าวแกงชาวใต้";
$a[744]="ร้านบะหมี่กวางตุ้ง เกี้ยว ปู";
$a[745]="คุณพรทิพย์ แสงศรี";
$a[746]="ป้าเหรียญอาหารเหนือ";
$a[747]="ร้านกุ๊กชัยแต้เตี้ยม";
$a[748]="ขนมจีนเจ๊แหม่ม";
$a[749]="เหนียวไก่รอซีญ๊ะ";
$a[750]="ร้านอาหารอิสลาม";
$a[751]="3J (เจ เจมส์ แจ็ส)";
$a[752]="ข้าวสตู";
$a[753]="ครัวรุ่งโรจน์";
$a[754]="Dr.Chick";
$a[755]="ก๋วยเตี๋ยวหมูทุบ";
$a[756]="ครัวรดามณี";
$a[757]="ไก่ทอดซอสเกาหลี";
$a[758]="ร้านบ้านเพื่อน";
$a[759]="หอมปลาเผา88";
$a[760]="ร้านข้าวหมูแดงชินกิจ (หน้า ญว)";
$a[761]="ร้านข้าวปั้น";
$a[762]="ข้าวมันไก่ทอดขมิ้น";
$a[763]="ก๋วยเตี๋ยวเรือ 10 บาท";
$a[764]="ร้านข้าวแกงสวนศิริ";
$a[765]="ร้านข้าวมันไก่ราชบุรี";
$a[766]="ร้านเจ๊อ้วนก๋วยเตี๋ยวเป็ด";
$a[767]="ร้านลุงริน";
$a[768]="ร้านจุ้นชิน";
$a[769]="ก๋วยเตี๋ยว2พี่น้อง";
$a[770]="ก๋วยเตี๋ยวเหล็กขูดโบราณ";
$a[771]="ร้านสวีท";
$a[772]="ทิเบต อาหารตามสั่ง";
$a[773]="Little Brown";
$a[774]="Be Myquest";
$a[775]="ขนมจีนอิสลาม";
$a[776]="ร้านเจอิ่มบุญ";
$a[777]="ข้าวแกงปิ่นแก้ว";
$a[778]="ข้าวแกงนครศรีฯ เจ๊มุ้ย";
$a[779]="ต้าหรอย";
$a[780]="ข้าวแกงปากพนัง";
$a[781]="ถึงพริกถึงขิงชาบู";
$a[782]="Super Bowl ก๋วยเตี๋ยวหมูต้มยำมะนาว";
$a[783]="คุณสรพัฒน์ ตั้งพัฒนะจิต";
$a[784]="ก๋วยเตี๋ยวต้มยำมังกรซ่า";
$a[785]="ร้านชวนชิม";
$a[786]="ร้านต้าซื่อสี่";
$a[787]="ร้านข้าวแกงวิไล";
$a[788]="ร้านอารีย์แต้เตี้ยม";
$a[789]="ร้านเตี๋ยวตูม";
$a[790]="ร้านเจ๊ตุ๊ก";
$a[791]="ระฟ้าติ่มซำ";
$a[792]="ร้านเอวัน";
$a[793]="ต้าเหยิน ช้าซิ๊ว";
$a[794]="ร้านครัวชุมชนกันเอง";
$a[795]="ร้านอุดมโภชนา";
$a[796]="ร้านกุ๊กเซ็ง";
$a[797]="ร้านก๋วยเตี๋ยวหางหมู";
$a[798]="ร้านเสน่ห์ไม้";
$a[799]="ร้านฝีมือนาง";
$a[800]="คุณธวัช โทวระ";
$a[801]="คุณสุภาพร ธีรภาพธนารักษ์";
$a[802]="เมียงปลา";
$a[803]="อาหารตามสั่งหัวสะพาน";
$a[804]="ข้าวแกงนายยักษ์";
$a[805]="เพชรเกษม";
$a[806]="เชย";
$a[807]="โจ๊กหม้อเติบ";
$a[808]="ร้านก๋วยเตี๋ยวลุงเรือง";
$a[809]="คุณเพ็ญภัก ใจแก้ว";
$a[810]="ร้าน บูม บูม";
$a[811]="คุณบุรณี บุญส่ง";
$a[812]="ร้านส้มตำหลวงทีป";
$a[813]="ร้านก๋วยเตี๋ยวเจ๊ฮวน";
$a[814]="ร้าน วาตาชิ";
$a[815]="ร้านนายสะอาด";
$a[816]="บ้านนายหลำ";
$a[817]="คุณเจริญ แก้วมณี";
$a[818]="ร้านเจ๊ญา";
$a[819]="คุณพิมล เพชรโรจน์";
$a[820]="ร้านบ้านป้าย้อย(สะเดาเจ้าเก่า)";
$a[821]="ร้านอารีย์แต่เตี๊ยม2";
$a[822]="ไก่ย่างน้ำน้อย สาขา3";
$a[823]="บังแอ";
$a[824]="ก๋วยเตี๋ยวลูกชิ้นปลา เจ้เฮี้ยง";
$a[825]="ร้านก๋วยเตี๋ยวสุโขทัย";
$a[826]="The Chef";
$a[827]="จันทร์เจ้า";
$a[828]="โกอ้าเตี๋ยวหมูทุบ";
$a[829]="ข้าวหมูย่างตรัง";
$a[830]="ร้านมนตรีหมี่เป็ด";
$a[831]="ร้านเพ้อเจ้อ";
$a[832]="คุณวรรณ ชูกำเนิด";
$a[833]="ร้านไก่ทอดเดชา";
$a[834]="ร้านไก่ทอดอาบัง";
$a[835]="อาอี้ เนื้อย่างเกาหลี";
$a[836]="สี่แมนชั่น ป้ายิ้ม";
$a[837]="อรุณศรี อามาตย์";
$a[838]="ผัดไทยกุ้งสด";
$a[839]="ก๋วยเตี๋ยวหมูตุ๋น";
$a[840]="เจ้าตังค์";
$a[841]="ร้านก๋วยเตี๋ยวเรือเมย์";
$a[842]="โจ๊กไก่";
$a[843]="ร้านซามูไร";
$a[844]="ร้านยำสดรสแซ่บ";
$a[845]="คุณเกตพร บุญทอง";
$a[846]="ป้าช่อ";
$a[847]="ร้านครัวอิ่มอุ่น";
$a[848]="ส้มตำสองภู";
$a[849]="ร้านอาหารอิสลาม";
$a[850]="ร้านโบ๊ต";
$a[851]="Look Lok";
$a[852]="ELEVEN-SEVEN";
$a[853]="ป้าประดับ";
$a[854]="แม่ประนอมปลาเผา";
$a[855]="สเต็ก by ซิทนี่ ช่องเขา";
$a[856]="ร้านป้าแมว";
$a[857]="คุณวัลลีย์ เเซ่จำ";
$a[858]="คอหนังแต่เตี๊ยม";
$a[859]="คุณพา จันทร์นวล";
$a[860]="ร้านพุงกาง";
$a[861]="ร้านข้าวแกงเมืองลุง";
$a[862]="ร้านราชาหมีเกี๋ยว";
$a[863]="ร้าน สท.กบ";
$a[864]="ร้านก๋วยเตี๋ยวเป่าปาก";
$a[865]="โดดเดี่ยวหมื่นลี้";
$a[866]="ข้าวแกงพี่จิ๋ม";
$a[867]="ร้านโกแซน";
$a[868]="ร้านอีสานบ้านใต้";
$a[869]="ร้านก๋วยเตี๋ยวหมูราดหน้าปักธง";
$a[870]="ร้านพี่วิลัย";
$a[871]="ร้านข้างแกงคนคอน";
$a[872]="ร้านปิ่นทอง";
$a[873]="ร้านเจ้ป่อง";
$a[874]="ครัวข้าวหอม ข้าวแกงเมืองลุง";
$a[875]="ร้านขนมจีน";
$a[876]="ร้านกินเส้น";
$a[877]="ครัวส้มตำ";
$a[878]="ครัวปั้นหยา";
$a[879]="บังเลาะห์โภชนา";
$a[880]="ร้านรัชกร";
$a[881]="พี่นุชโภชนา";
$a[882]="ร้านข้าวมันไก่คอหงส์";
$a[883]="ครัวบ้านทุ่งcafe'";
$a[884]="อาทิพย์-จันทร์";
$a[885]="ต้า ซื้อ สี่ บะหมี่เบตง สาขาทุ่งลุง";
$a[886]="เจ้ตุ๋นก๋วยเตี๋ยวน้ำตก";
$a[887]="ครัวรัตน์ตะวัน";
$a[888]="ส้มตำซีฟู๊ด";
$a[889]="Ruote 108";
$a[890]="ซินแส";
$a[891]="ครัวตัวยู";
$a[892]="สระ-cup";
$a[893]="คุณวรรณทนี ธนจีนาปัด";
$a[894]="ร้านเจริญศรี";
$a[895]="ร้านก๋วยเตี๋ยวรถไฟ";
$a[896]="ร้านก๋วยเตี๋ยวพิษณุโลก";
$a[897]="ร้านข้าวมันไก่พี่น้องทุ่งลุง";
$a[898]="ร้านข้าวมันไก่ทุ่งลุง(เจ้าเก่า)";
$a[899]="ร้านใจสั่งมา";
$a[900]="ร้านเย็นตาโฟทุ่งลุง";
$a[901]="ร้านน้องหญิง";
$a[902]="คุณวิรัตน์ หมันดี";
$a[903]="คุณสุนทร หนูอุไร";
$a[904]="คุณเดือนรุ่ง";
$a[905]="ร้านป้าสาว";
$a[906]="เย็นตาโฟ";
$a[907]="ร้านฟ้าใส";
$a[908]="ข้าวขาหมู";
$a[909]="ก๋วยเตี๋ยวเรือเมย์ สาขาทุ่งลุ่ง";
$a[910]="พี่แหลมส้มตำ";
$a[911]="ร้านชุมแสงจันทร์ โภชนา";
$a[912]="ข้าวแกงเมืองลุง";
$a[913]="เจ๊ดี";
$a[914]="ร้านอาหารทับทุ่งลาน";
$a[915]="ร้านน้องกวาง";
$a[916]="ร้านเจ๊รุ่ง";
$a[917]="เจ๊หมวย บ้านพรุ สาขา2";
$a[918]="บ้านไร่ชายทุ่ง";
$a[919]="คุณลัดดา เส็บยีหีม";
$a[920]="พี่เอียด พี่เขียว";
$a[921]="Asian";
$a[922]="ข้าวแกงลุงนึก";
$a[923]="ส้มตำป้าดวน";
$a[924]="โกเก่งหลานข้าวมันไก่คลองหวะ";
$a[925]="ไทยมุสลิม";
$a[926]="ร้านกะเปีย";
$a[927]="น้องนาย";
$a[928]="ป้าเหมือน ข้าวหมูทอด";
$a[929]="ร้านข้าวแกงบุษยา";
$a[930]="ร้านไทยมุสลิม 2";
$a[931]="ร้านครัวมุสลิม";
$a[932]="ร้านข้าวมันไก่ไหหลำ";
$a[933]="ร้านพี่หมวย";
$a[934]="ร้านภัทรพกฤตก๋วยเตี๋ยวจัมโบ้สูตรสุโ";
$a[935]="คลองแหเนื้อกะทะ";
$a[936]="ครัวบุปผา";
$a[937]="เจ๊สาว";
$a[938]="ชมวิวริมคลอง";
$a[939]="คุณสุนิตา กวดขัน";
$a[940]="คุณมาเรียม อิสภาพ";
$a[941]="ครัวข้าวถุ้ง";
$a[942]="ครัวสวนเม่า";
$a[943]="ครัวชนิตา";
$a[944]="ร้านครัวริมคลอง";
$a[945]="คุณวลีพรรณ ภูภักดี";
$a[946]="ชุมทาง(ณ)ท่านางหอม";
$a[947]="ครัวสองพี่น้อง";
$a[948]="หม้อข้าวหม้อแกง";
$a[949]="ป้ารีย์";
$a[950]="คุณสุข้าวขาหมู";
$a[951]="ก๋วยเตี๋ยวเรือหน้าวัดคลองแห";
$a[952]="พี่ดี";
$a[953]="ร้านข้าวดัง หอมดิน";
$a[954]="เสน่ห์นางหอม";
$a[955]="ครัวขุนเมือง";
$a[956]="ตำรับอีสาน";
$a[957]="ร้านอาหารบ้านแม่ยาย";
$a[958]="ข้าวแกงป้าอ้อย";
$a[959]="ศูนย์ท่องเที่ยวธรรมชาติและวัฒนธรรม";
$a[960]="บารอกัต";
$a[961]="อัณวัร คิชเช่น";
$a[962]="ร้านลมโชย";
$a[963]="ครัวหัวโค้ง";
$a[964]="คุณอาลัย ทวนแก้ว";
$a[965]="แลงมาเช";
$a[966]="ร้านอีสานกันเอง";
$a[967]="น้องบอล";
$a[968]="ร้านก๋วยเตี๋ยวหมู เพ็ชรสุทธิ์";
$a[969]="คุณพรรณณี เรืองหนู";
$a[970]="คุณอุไร ผดุงเดช";
$a[971]="คุณสุพัต บุญมา";
$a[972]="ข้าวแกงพุงกาง";
$a[973]="ก๋วยเตี๋ยวแม่ผักระยอง";
$a[974]="ชายสี่หมี่เกี๊ยว";
$a[975]="ร้านส้มตำป้าพร";
$a[976]="คุณสุภาวดี ชำนาญ";
$a[977]="ก๋วยเตี๋ยวเรือลพบุรีราเมศวร์";
$a[978]="คุณปาริชาติ 2";
$a[979]="นายสะอาด";
$a[980]="แม่เพ็ญ";
$a[981]="พี่น้อย";
$a[982]="ประจวบแม่พี่ออ";
$a[983]="บังกาด";
$a[984]="ผัดไท เตาถ่าน";
$a[985]="พี่ญา";
$a[986]="ป้าทัยก๋วยเตี๋ยวน้ำใส-ต้มยำ";
$a[987]="ร่มไม้";
$a[988]="ข้าวมันไก่ ก๋วยเตี๋ยวเนื้อเปื่อย";
$a[989]="ขนมจีนรสเด็ด 10 ตุลา";
$a[990]="ก๋วยเตี๋ยวเย็นตาโฟ";
$a[991]="ร้านอาเก๋าหน้าวัด";
$a[992]="ลาบยโส";
$a[993]="ก๋วยเตี๋ยวหล่มสัก";
$a[994]="ครัวตาวันอีสานรสแซ่บ2";
$a[995]="99";
$a[996]="ครัวคุณลุง";
$a[997]="ข้าวแกงระโนด";
$a[998]="ร้านยีหลี";
$a[999]="พี่ชาติ";
$a[1000]="ก๋วยเตี๋ยวมังกร";
$a[1001]="ร้านกวางทอง";
$a[1002]="ข้าวแกงอาหารตามสั่งคลองแห";
$a[1003]="อีสานรสแซ่บ";
$a[1004]="ข้าวแกงแม่ประดับ";
$a[1005]="ร้านอาหารเรือนไม้";
$a[1006]="ครัวคลองแห";
$a[1007]="ครัวสองพี่น้อง";
$a[1008]="ครัวคนบ้านสวน";
$a[1009]="ป้าโญ";
$a[1010]="ครัวแม่แดง";
$a[1011]="ร้านอาหารร้อยรส";
$a[1012]="ข้าวแกงบ้านเบญจวรรณเจ๊ต้อย";
$a[1013]="ร้านอีสานรสเด็ด";
$a[1014]="คุณศิรินภา โลหะ";
$a[1015]="ร้านสวนอาหารพี่น้อง";
$a[1016]="กฤษณาปลาเผา(ครัวสิเหรง)";
$a[1017]="ร้านบันไดนาง";
$a[1018]="สวนโตน";
$a[1019]="ร้านวังร่มเมือง";
$a[1020]="น้ำตกวังเนียงทอง";
$a[1021]="ร้านอาหารพี่นิด";
$a[1022]="ร้านอาหารริมคลอง";
$a[1023]="ร้านครัวหน้าโตน";
$a[1024]="ร้านพี่น๊ะ";
$a[1025]="ร้านอาหารกลมกล่อม";
$a[1026]="ป้าริน บรรรัตนะ";
$a[1027]="ครัวอีสาน";
$a[1028]="ข้าวต้มโต้รุ่ง";
$a[1029]="ก๋วยเตี๋ยวเรือเจ๊เดือน";
$a[1030]="ครัวชวนชิม";
$a[1031]="ครัวหลังสวน";
$a[1032]="เจ๊น้อยปลาดุกย่าง";
$a[1033]="เจ๊ต้อยก๋วยเตี๋ยวเรือ";
$a[1034]="ร้านหมูหมูเย็นตาโฟ";
$a[1035]="ครัวเซฟมอส";
$a[1036]="พี่ไพอาหารตามสั่ง";
$a[1037]="ร้านศรีข้าวแกง";
$a[1038]="ร้านฮูดาโภชนา";
$a[1039]="ร้านอาหารมุสลิมแกงแพะ";
$a[1040]="ร้านครัว 4ยอ";
$a[1041]="คุณช่วง อาวรณ์เจริญ";
$a[1042]="คุณสุนทร ชิตมณี";
$a[1043]="ร้านส้มตำพี่จวบ";
$a[1044]="พี่สาวอาหารตามสั่ง";
$a[1045]="ร้านพี่ตุ้ย สาขา2";
$a[1046]="นายโอมข้าวมันไก่";
$a[1047]="ก๋วยเตี๋ยวเรือโอฬาร สาขา 5";
$a[1048]="กม.10โฮม";
$a[1049]="ฅนคร";
$a[1050]="คุณสมพงษ์ ฆ้งวารี";
$a[1051]="ส้มตำรำซิ้ง";
$a[1052]="ลัดดา มูเก็ม";
$a[1053]="ก๋วยเตี๋ยวป้าดา";
$a[1054]="คุณอำนวย จันจุฬา";
$a[1055]="คุณสาย มีสุขศรี";
$a[1056]="บ่าววี";
$a[1057]="สมนึกผัดไท ข้าวมันไก่";
$a[1058]="ร้านก๋วยเตี๋ยวราดหน้าราโดสาขา5";
$a[1059]="ร้านลุงระลาบแซบ";
$a[1060]="คุณคล่อง หัสดำ";
$a[1061]="ร้านบ้านตาชั่ง";
$a[1062]="ร้านเรือนแสงจันทร์";
$a[1063]="ข้าวแกงพี่หญิง";
$a[1064]="คุณอัจฉรา นวลบุญ";
$a[1065]="ร้านป้ามร";
$a[1066]="นางฟ้าตำถาด";
$a[1067]="ชะลอมข้าวแกงพื้นบ้าน";
$a[1068]="จิระเพชร2";
$a[1069]="ก๋วยเตี๋ยวหมูเด้ง";
$a[1070]="ขนมจีนป้าชื่น สาขา 3";
$a[1071]="ร้านน้องเพลง";
$a[1072]="ดินดีซีฟู๊ดอาหารตามสั่ง";
$a[1073]="ร้านสามป้าชะอวด";
$a[1074]="กระเทยตำระเบิด";
$a[1075]="ร้านอาหารไซน่า 1";
$a[1076]="ข้าวหมูแดงบุญเอก";
$a[1077]="มาตะ";
$a[1078]="ร้านข้าวแกงพี่ปราณี";
$a[1079]="ข้าวแกงพี่ผิว";
$a[1080]="ร้านข้าวหมูแดง หมูกรอบ";
$a[1081]="ร้านป้าบัวอาหารตามสั่ง";
$a[1082]="ร้านอาหารซินจ่าเวียน";
$a[1083]="ร้านอาหารหุสนา";
$a[1084]="ร้านปิ่นอนงค์ก๋วยเตี๋ยวเรือ";
$a[1085]="ก๋วยเตี๋ยวเรือ เด้ง-แซ่บ";
$a[1086]="ร้านครัวน้องนนท์";
$a[1087]="ก๋วยเตี๋ยวไม้เขียว";
$a[1088]="บะหมี่กวางตุ้ง";
$a[1089]="ร้านน้องนา";
$a[1090]="สถาพร ลอดฤทธิ์";
$a[1091]="สตีทฟู้ด";
$a[1092]="สภากาแฟ";
$a[1093]="เมนูสเต็ก 2";
$a[1094]="ก๋วยเตี๊ยวเรือ 20เหรียญ";
$a[1095]="เกตุ จันทร์แก้ว";
$a[1096]="โกต่าย ก๋วยเตี๋ยวหมู ชามยักษ์";
$a[1097]="คุณหมอ หลำดารา";
$a[1098]="คุณอารีย์ ชูนุกิจ";
$a[1099]="ร้านพี่อุ๊";
$a[1100]="ข้าวหมูแดงชินกิจ";
$a[1101]="คุณกฤษฎา แถรพันธ์";
$a[1102]="ครัวโกหมิง";
$a[1103]="จุรี เจริญมหาดไทย";
$a[1104]="สวรรณี ชูแก้ว";
$a[1105]="ก๋วยเตี๋ยวป้าใจ";
$a[1106]="ก๋วยเตี๋ยวหางหมู";
$a[1107]="ร้านน้องปีโร่";
$a[1108]="ครัวนางฟ้า";
$a[1109]="ร้านน้องแมว";
$a[1110]="คุณเกศิณี แซ่ลิ่ม";
$a[1111]="เอ็น เอ็น ก๋วยเตี๋ยวหมูทุบ";
$a[1112]="ร้านก๊กเล็ก";
$a[1113]="ร้านข้าวผัดปู";
$a[1114]="ร้านพี่นก";
$a[1115]="ตุ๊กตุ๊กอาหารตามสั่ง";
$a[1116]="ร้านข้าวแกงป้าจันทร์";
$a[1117]="คุณสมเกียรติ แซ่กู้";
$a[1118]="ป้าติ๋มข้าวแกงนครศรีฯ";
$a[1119]="ข้าวมันไก่กันตภณ";
$a[1120]="ร้านก๋วยเตี๋ยววังชะโอน";
$a[1121]="ร้านน้องปอย";
$a[1122]="ก๋วยเตี๋ยวเรือโอฬาร";
$a[1123]="ข้าวขาหมูเห็ดหอม";
$a[1124]="ร้านก๋วยเตี๋ยวลุงโชค";
$a[1125]="รสอีสาน";
$a[1126]="มีโชค";
$a[1127]="ราดหน้าราโด้";
$a[1128]="คุณประภาส จุลิวรรณลีย์";
$a[1129]="ก๋วยจั๊บไก่";
$a[1130]="ร้านข้าวแกงพัทลุง ครัวโอชา";
$a[1131]="ร้านแต่เตี้ยมหาดใหญ่ใน";
$a[1132]="ครัวกุ๊กต้าร์";
$a[1133]="ร้านลักกี้นู้ดเดิ้ล";
$a[1134]="ข้าวมันไก่น้องพะแพง";
$a[1135]="ร้านโกแต๋";
$a[1136]="ร้านพี่มร";
$a[1137]="ร้านก๋วยจั๊บป้าไพ";
$a[1138]="ร้านบังหมาน";
$a[1139]="ข้าวต้มโต้รุ่งธนาทิพย์";
$a[1140]="ร้านก๊ะสาว อาหารฮาลาล";
$a[1141]="ร้านก๋วยเตี๋ยวป้านุช";
$a[1142]="คุณอรวรรณ เมืองจันทบุรี";
$a[1143]="เตี๋ยวเป็ดสุโขทัย";
$a[1144]="ขนมจีนแม่สุ";
$a[1145]="เตี๋ยว ซ.9";
$a[1146]="บิ๊กจั๊บ";
$a[1147]="ข้าวแกงพัทลุง";
$a[1148]="คุณน้อย บุญรัตน์";
$a[1149]="ร้านน้องน้ำชา";
$a[1150]="คุณเรวดี ชัวยสังค์";
$a[1151]="ขนมจีนหน้าสวน";
$a[1152]="ข้าวหมูแดงชินกิจ";
$a[1153]="คุณทฤฒมน ขวัญคง";
$a[1154]="คุณวิไลวรรณ ราชดาเพชร";
$a[1155]="ครัวลูกแม่ราณี";
$a[1156]="ครัวสำเภาทองเกาะยอ";
$a[1157]="เรือนตะวัน ก๋วยเตี๋ยวไก่";
$a[1158]="ก๋วยเตี๋ยวมะระ";
$a[1159]="ลุงรอกปลาเผา";
$a[1160]="ก๋วยเตี๋ยวหางหมู";
$a[1161]="ครัวไทรทอง";
$a[1162]="น้องจูนดีอาหารตามสั่ง";
$a[1163]="ก่วยเตี๋ยวหมูน้ำตก";
$a[1164]="ครัว ป.ปลา";
$a[1165]="ร้านเย็นตาโฟบัณฑิต";
$a[1166]="อิสลามรอฟ๊ะ";
$a[1167]="ข้าวต้มน้ำทิพย์";
$a[1168]="คุณกฤตวรรณ หงษ์สกุล";
$a[1169]="คุณสงกรานต์ สุปการ";
$a[1170]="คุณจุฑามาศ นวลศรี";
$a[1171]="ร้านอาหารบ้านนายไข่";
$a[1172]="ร้านอาหารป้าแดง";
$a[1173]="ร้านอาเส็งข้าวขาหมู";
$a[1174]="ข้าวมันไก่";
$a[1175]="พี่นีย์อาหารตามสั่ง";
$a[1176]="ร้านลุงโชค";
$a[1177]="ร้านเเกงราดข้าวหน้าสวน";
$a[1178]="ร้านวิไลรัตน์";
$a[1179]="ล้อเกวียน";
$a[1180]="ฮาลาล2";
$a[1181]="คุณประภาพร ชูเชิด";
$a[1182]="พี่สาวอาหารตามสั่ง";
$a[1183]="ร้านบ้านป้าย้อย";
$a[1184]="ร้านหงษ์ฟ้าโกปี้";
$a[1185]="ร้านป้าบล";
$a[1186]="ร้านเย็นตาโฟ";
$a[1187]="ร้านอาหารอีสานริมคลอง";
$a[1188]="รุ่งโรจน์โภชนา";
$a[1189]="คุณอารีย์ พุทธวัล";
$a[1190]="ร้านไก่ย่างเขาสวนกวาง";
$a[1191]="ส้มตำหน้าสวน";
$a[1192]="เจ๊โอ";
$a[1193]="พี่แมว";
$a[1194]="ครูหวน";
$a[1195]="ร้านบ้านพ่อ";
$a[1196]="คุณสุมาลี ไทศิริกุล";
$a[1197]="คุณนันท์นภัสร์ จันทร์สว่าง";
$a[1198]="โกอ้วนติ่มซำ@สตูล สาขา3";
$a[1199]="ร้านเกลอ";
$a[1200]="ม้าหมุน";
$a[1201]="ขนมจีนโกเปียก";
$a[1202]="ก๋วยเตี๋ยวหมูโกยุทธ";
$a[1203]="ครัวป้านา";
$a[1204]="สวัสดิการ อ.อ.ป.";
$a[1205]="ตำส้มแซ่บ";
$a[1206]="คุณอัญชลี ศรีสุวรรณ";
$a[1207]="ร้านชุมทางหาดใหญ่";
$a[1208]="ร้านกุ๊กนิว";
$a[1209]="ร้านข้าวขาหมูรวมพร";
$a[1210]="ร้านไทยมาเลย์";
$a[1211]="ก๋วยเตี๋ยวเรือสูตรโบราณ";
$a[1212]="โกยงค์";
$a[1213]="คุณเสริม ทวีศรี";
$a[1214]="อรุณโภชนา";
$a[1215]="ชายสี่บะหมีเกี๊ยว";
$a[1216]="โกเฉื่อย";
$a[1217]="คุณกิ่งเพชร สุขกรง";
$a[1218]="ร้านขนมจีนเส้นสดนวลแก้ว";
$a[1219]="คุณหทัยทอง เอื่อมอักษร";
$a[1220]="ก๋วยเตี๋ยวต้มยำ2";
$a[1221]="ก๋วยเตี๋ยวเย็นตาโฟป้าดาว";
$a[1222]="ก๋วยเตี๋ยวจั๊บ";
$a[1223]="ร้านครัวป้านง";
$a[1224]="ขนมจีนมือถือ";
$a[1225]="ร้านเรือนสำเภา";
$a[1226]="ส้มตำยอดมะพร้าว";
$a[1227]="ก๋วยเตี๋ยวเต็มเหนี่ยว";
$a[1228]="กุ๊กโต้ง";
$a[1229]="คุณศักดิ์สิทธิ์ ปรานประเสริฐ";
$a[1230]="กุ๊กทรง ภาสว่างโภชนา";
$a[1231]="พิซซ่าหมวยภาคใต้";
$a[1232]="คุณประยงค์ พรรณราย";
$a[1233]="ป้าภา";
$a[1234]="อัสมา";
$a[1235]="พี่ละออโพธ์พงษา";
$a[1236]="ร้านป้าแดงข้าวแกง";
$a[1237]="ร้านพี่ยา";
$a[1238]="ร้านซุ้มอีสาน";
$a[1239]="ร้านป้านา";
$a[1240]="ร้านขนมจีนท่าวัง";
$a[1241]="ร้านช้อนเงิน";
$a[1242]="ครัวครบรส";
$a[1243]="ครัวคุณเภา";
$a[1244]="เจ๊สุนีข้าวขาหมู";
$a[1245]="จอมรส";
$a[1246]="เย็นตาโฟ";
$a[1247]="ครัวปาหนัน";
$a[1248]="ร้านลาบอีสาน";
$a[1249]="ป้าผล";
$a[1250]="คุณถนอม ชิตวัฒน์";
$a[1251]="อาหารอีสานลาบร้อยเอ็ด";
$a[1252]="โรงเตี๊ยมมุสลิม";
$a[1253]="ซาร่าฟิชซ่า";
$a[1254]="ซุ้มต้นกล้วย";
$a[1255]="นัสรีน";
$a[1256]="กะนะห์ยะลา";
$a[1257]="เซินแซ่บ";
$a[1258]="คุณอาฉ๊ะ แหละตี";
$a[1259]="ครัวยกครกกระดกสาก";
$a[1260]="ป้าสาว";
$a[1261]="พฤกษา โฟล์ค";
$a[1262]="คุณสายไหม แก้วกระจ่าง";
$a[1263]="ข้าวมันไก่ห้าดาว";
$a[1264]="ร้านฮอเจี๊ยะ";
$a[1265]="คุณสอฟีย๊ะ ชัยชนะ";
$a[1266]="ร้านไซน่า2";
$a[1267]="คุณประดับ ช่วยดำรงค์";
$a[1268]="อีสานรสแซบ";
$a[1269]="คุณฐิติรัตน์ เอื่อมเจริญ";
$a[1270]="คุณวีรภัทร์ มหามงคล";
$a[1271]="คุณวิรัตน์ สุธรรมกุล";
$a[1272]="คุณจินตนา ชัยกิจ";
$a[1273]="จีรพันธ์ฮาลาลฟู๊ด";
$a[1274]="ร้านพี่โฉม";
$a[1275]="ร้านลาบลำภู";
$a[1276]="ร้านส้มตำกะฉ๊";
$a[1277]="มุสลิมอีสาน";
$a[1278]="ครัวต้นตาล";
$a[1279]="ร้านอาหารอัสมา";
$a[1280]="ข้าวหมูแดงชินกิจ";
$a[1281]="ป้าแก้ว";
$a[1282]="หวันอะเสียะ";
$a[1283]="ดวงพร สลักดำ";
$a[1284]="คุณธนวันต์ ทองเหลือง";
$a[1285]="เอกก๋วยเตี๋ยวหมูต้มยำ";
$a[1286]="คุณหนู ศิริวรรณ";
$a[1287]="ชายสี่บะหมี่เกี้ยว";
$a[1288]="น้องซัน";
$a[1289]="บังเสรี";
$a[1290]="หวะม๊ะ";
$a[1291]="ว๊ะเหย๊าะ";
$a[1292]="คุณสมใจ ศรไพบูรณ์";
$a[1293]="คุณสุกรี อุมา(กะน๊ะ)";
$a[1294]="บังบาว";
$a[1295]="คุณประชิด พูลเพิ่ม";
$a[1296]="ร้านสเเน็ค";
$a[1297]="คุณอุษา กิตติทวีโชติ";
$a[1298]="ป้านอม พร้อมมูล";
$a[1299]="พี่เล็กอาหารตามสั่ง";
$a[1300]="จิระเพชร";
$a[1301]="ข้าวแกงครัวเอก";
$a[1302]="ซัมซัม";
$a[1303]="ฮัจยีเล๊าะ";
$a[1304]="บังบุก";
$a[1305]="ข้าวมันไก่เจ๊ะสาว";
$a[1306]="ครัวเหมมัน";
$a[1307]="คุณวันเพ็ญ วิชุนดาวุธ";
$a[1308]="คุณวรรณี อ่อนฝัน";
$a[1309]="คุณกัลยารัตน์ มนุโชค";
$a[1310]="คุณจรันทร์ การเกตุ";
$a[1311]="ไท่เซ่งฮวด";
$a[1312]="ฟ้ารักษ์";
$a[1313]="มุ้ยเฮียงโอชา";
$a[1314]="คุณวิภา";
$a[1315]="ข้าวสวย";
$a[1316]="ไอ้บังชามใหญ่";
$a[1317]="ก๋วยเตี๋ยวยายแผ้ว";
$a[1318]="ฮัจยีสัน";
$a[1319]="คุณมีศักดิ์ เยี่ยมพาณิชย์";
$a[1320]="คุณพิศิษย์ ตนตระการณ์";
$a[1321]="คุณมนันยา บิลละ";
$a[1322]="ก๋วยเตี๋ยวชามใหญ่";
$a[1323]="ก๋วยเตี๋ยวเรือวงเวียน";
$a[1324]="คุณเกลือน อิสโร";
$a[1325]="คุณสุรชัย แซ่เฮง";
$a[1326]="ร้าน 6 พี่น้อง สุกี้ บุฟเฟต์";
$a[1327]="ร้านหม้อใหญ่";
$a[1328]="ร้านฮะเฮง ติ่มซำ";
$a[1329]="ห้างหุ้นส่วนจำกัด ปรภัค กรุ๊ป";
$a[1330]="คุณสิทซีฟู๊ต";
$a[1331]="ไทย-มาเลเซีย";
$a[1332]="Mook Hi Zeed";
$a[1333]="โจ๊กหมู กระเพาะปลา";
$a[1334]="คูกิมิยะ";
$a[1335]="แซ่บหรอย";
$a[1336]="ร้านตี๋ใหญ่4";
$a[1337]="ข้าวต้มนายหัว";
$a[1338]="หมี่เป็ดตุ๋นปักกิ่ง";
$a[1339]="ก๋วยจั๋บไก่กระเพาะปลา";
$a[1340]="คุณสมหมาย เหล่าเท้ง";
$a[1341]="ร้านมะกอก";
$a[1342]="พี่น้องตลาดโต้รุ่ง";
$a[1343]="เฮียไก่ซีฟู๊ต";
$a[1344]="โกชัด";
$a[1345]="สมิหลาซีฟู้ด";
$a[1346]="คุณศิริพรรณ";
$a[1347]="ร้านข้าวต้มธนาทิพย์";
$a[1348]="เนาวรัตน์";
$a[1349]="ร้านในรู";
$a[1350]="ข้าวต้มปลา";
$a[1351]="อามีเน๊ะ";
$a[1352]="ฮั่วเซียง";
$a[1353]="เจ๊หมวยก๋วยเตี๋ยวเย็นตาโฟรสเด็ด";
$a[1354]="ร้านข้าวมันไก่ทอดAFC";
$a[1355]="ธิดาส้มตำ";
$a[1356]="คุณสุรชัย ภิรภาตยกุล";
$a[1357]="เจ๊หมวย";
$a[1358]="แซบอีสาน";
$a[1359]="สุกีตี๋เล็ก";
$a[1360]="เตียงฮวด";
$a[1361]="A Cap";
$a[1362]="คุณวุฒิพงศ์ แซ่เจีย";
$a[1363]="ตี๋ใหญ่ (คุณเพ็ญพรรณ)";
$a[1364]="เจ๊เฮียงก๋วยเตี๋ยว";
$a[1365]="คุณพศิน อังชยกุล";
$a[1366]="แซ่บนัวครัวอีสาน";
$a[1367]="โรจนะมันไก่";
$a[1368]="ไต้ซีอี้";
$a[1369]="สุภาพร สังข์ทอง";
$a[1370]="คลองเตยซีฟู้ด";
$a[1371]="ข้าวขาหมู (จันทร์เพ็ญ)";
$a[1372]="ลุงบ่าว";
$a[1373]="พิทแพร้ว";
$a[1374]="จีระแต้เตี้ยม";
$a[1375]="คุณอรุณ รัศมี";
$a[1376]="ร้านลงเอย";
$a[1377]="ก๋วยเตี๋ยวพิน";
$a[1378]="ขนมจีนพี่นิต";
$a[1379]="ข้าวมันไก่รสเด็ด";
$a[1380]="หลวงทีปขนมจีน";
$a[1381]="ร้านอาหารบัวหลวง";
$a[1382]="บางรัก";
$a[1383]="ร้าน+น้ำ+นม";
$a[1384]="นครครัว";
$a[1385]="UP TO ME";
$a[1386]="Say Cheese";
$a[1387]="บอนไทร";
$a[1388]="บะหมี่เป็ด";
$a[1389]="ป้าพร";
$a[1390]="รวงข้าว";
$a[1391]="อยู่หนูสิงห์";
$a[1392]="ร้านนายซ้งหมูทุบ";
$a[1393]="ร้านครัวเกาะเสือ";
$a[1394]="ร้านเย็นตาโฟเกาะเสือ";
$a[1395]="ร้านอร่อยต้องลอง";
$a[1396]="ขนมจีนป้าแหม่ม";
$a[1397]="ร้านอาหารริมทาง";
$a[1398]="ร้านหัวปลาหม้อไฟ";
$a[1399]="มาลองสเต็ก";
$a[1400]="ร้านครัวอาภา";
$a[1401]="ร้านเลี่ยงจั๊ว";
$a[1402]="อาหารพื้นบ้าน";
$a[1403]="สองพี่น้อง ญ.ว.";
$a[1404]="โกวุธอาหารตามสั่ง";
$a[1405]="ปุ่น (อาหารตามสั่ง)";
$a[1406]="ข้าวแกงพี่ติ๋ม";
$a[1407]="ราดหน้านายพล";
$a[1408]="เฮียปิง";
$a[1409]="คอหนังแต้เตี้ยม";
$a[1410]="ลิ้มฮวดเส็ง";
$a[1411]="ส้มตำครกทอง";
$a[1412]="น้องเพชรติ๋มซำ";
$a[1413]="ข้าวหมูแดงมรกต";
$a[1414]="แล้วแต่";
$a[1415]="ดีวะ Dee-wa";
$a[1416]="ส้มตำคาเฟ่";
$a[1417]="Mezza Cafe";
$a[1418]="ครัวพี่ศักดิ์";
$a[1419]="ณ.ธิดาบะหมี่จับกังและอาหารเช้า";
$a[1420]="ซุปเปอร์นายหัว";
$a[1421]="ข้าวแกงเมืองลุง";
$a[1422]="ร้านครัวข้าวหอม";
$a[1423]="ร้านน้องบีม";
$a[1424]="คุณรสสุคนธ์";
$a[1425]="ข้าวมันไก่อิ่มเอม";
$a[1426]="มนัสนันท์ สังข์รัตน์";
$a[1427]="ข้าวมันไก่ไหหลำ";
$a[1428]="เปรมจิตโอชา";
$a[1429]="พี่เล็ก";
$a[1430]="ส้มตำครกทองสาขา 2";
$a[1431]="ก๊ะนุ้ย";
$a[1432]="โกดำ";
$a[1433]="คุณศจิกา นวตระกูล";
$a[1434]="บ้านคุณปู่-คุณย่า";
$a[1435]="มาตะ ชาบู";
$a[1436]="สถานีหอย";
$a[1437]="ก๋วยเตี๋ยวเรืออยุธยา";
$a[1438]="ส้มตำป้าเพลิน";
$a[1439]="คุณอุไรวรรณ วรรณพฤษ";
$a[1440]="ร้านจันทร์หอม";
$a[1441]="ข้าวมันไก่ไจแอนท์";
$a[1442]="ก๋วยเตี๋ยวเรือเร็ว";
$a[1443]="ไก่ทอด ซ.10";
$a[1444]="พี่หมวย";
$a[1445]="บิ๊กปูเย็นตาโฟ";
$a[1446]="อุไร อินทร์รัศมี";
$a[1447]="ร้านจีมา";
$a[1448]="ส้มตำ";
$a[1449]="ร้านอาหารกอไผ่";
$a[1450]="เฮียวัฒน์";
$a[1451]="คุณวาสนา";
$a[1452]="ข้าวมันไก่คลองแห";
$a[1453]="เกาเหลาเลือดหมู";
$a[1454]="ก๋วยเตี๋ยวหมู";
$a[1455]="ข้าวต้มพาสพร";
$a[1456]="ก๋วยเตี๋ยวแชมป์";
$a[1457]="ส้มตำป้าพรรณ";
$a[1458]="อาหารบ้าน";
$a[1459]="ฟาร์เบอร์เกอร์";
$a[1460]="สเต็กตาหวาน";
$a[1461]="โรงอาหารอำนวยวิทย์ ปวช.";
$a[1462]="อาลีฟ กระทะร้อน";
$a[1463]="คุณกัญญาณี วงศ์สุวรรณ";
$a[1464]="ขนมจีนขุนศรีปากพนัง";
$a[1465]="ตำพันล้าน";
$a[1466]="EXIT";
$a[1467]="คุณดาราธร ธีราพรดำรง";
$a[1468]="eat time";
$a[1469]="ก๋วยเตี๋ยวพาเพลิน";
$a[1470]="ป้าเหลียบ";
$a[1471]="ร้านศรแดง";
$a[1472]="ข้าวหมูแดงอภัยรัตน์";
$a[1473]="สเต็กโชกุล";
$a[1474]="ก๋วยเตี๋ยวต้มยำกุ้ง มะนาวไข่หวาน";
$a[1475]="ไก่ใต้น้ำ";
$a[1476]="เจ๊เล็กลาบกาฬสินธุ์";
$a[1477]="แจ่วอีสาน";
$a[1478]="คุณเอิบ ธรรมชาติ";
$a[1479]="นครอีสาน";
$a[1480]="เจ๊หมูตามสั่ง";
$a[1481]="ร้านพี่กอล์ฟตามสั่ง";
$a[1482]="ร้านน้องสวย";
$a[1483]="ข้าวมันไก่โกฉิก";
$a[1484]="นางบรรจง สุภากาศ";
$a[1485]="ข้าวแกงตนคอน";
$a[1486]="อัสมามีน";
$a[1487]="ข้าวต้มนายสะอาด";
$a[1488]="ซุ้มซาบะ";
$a[1489]="ฮารารุ";
$a[1490]="ไก่ทอดเดชา";
$a[1491]="จิ๋มเมืองแคน";
$a[1492]="ก๋วยเตี๋ยวฟัตฮียา";
$a[1493]="ร้านชูใจ";
$a[1494]="ครัวสามชาย";
$a[1495]="ครัวปากนัง";
$a[1496]="ก๋วยเตี๋ยวเรือน้ำฟ้า";
$a[1497]="ข้าวต้มธนาทิพย์";
$a[1498]="เตี๋ยวเรือแซ่บเกินร้อย";
$a[1499]="ร้านตะเภาเงิน";
$a[1500]="ก๋วยเตี๋ยวเรือ";
$a[1501]="ป้าพรข้าวแกง";
$a[1502]="เจ๊ะนก ชายสี่หที่เกี๊ยว";
$a[1503]="ร้านอาหารคูเต่า2";
$a[1504]="คุณธารชัย จาตุพร";
$a[1505]="หมัด บิลหมาน";
$a[1506]="ตำหรับซีฟู๊ด ฮาลาล";
$a[1507]="เนื้อย่างเกาหลี Byฟอร์จูน";
$a[1508]="November";
$a[1509]="Chef K.";
$a[1510]="ข้าวต้ม 1 บาท เขต 8 คุณพีรพัฒน์ ปาน";
$a[1511]="แซ่บเวอร์หน้าอำเภอหาดใหญ่";
$a[1512]="ข้าวต้มกุ๊กเมย์";
$a[1513]="ผัดไทยกุ้งสด";
$a[1514]="ข้าวขาหมูเห็ดหอม";
$a[1515]="ร้านข้าวศีตะวัน";
$a[1516]="RED ตามสั่ง";
$a[1517]="ก๋วยจั๊บไก่";
$a[1518]="คูเต่า 3";
$a[1519]="ข้าวต้มปลาเก๋า";
$a[1520]="ร้านธงฟ้า";
$a[1521]="คุณเขมรัตน์ อมรพันธ์";
$a[1522]="ขนมจีนป้าฮวย";
$a[1523]="ข้าวมันไก่เขต 8";
$a[1524]="ธนาทิพย์ 1";
$a[1525]="ธนาทิพย์ 2";
$a[1526]="ข้าวมันไก่เบตง";
$a[1527]="ร้านอาหารแสงจันทร์";
$a[1528]="อีสานโต้รุ่ง";
$a[1529]="คุณลดาวัลย์ หวังศิริเวช";
$a[1530]="คุณอาทร ทองเอียด";
$a[1531]="เจ๊ฮวงผัดไทย สาขา 3";
$a[1532]="เบียร์วุ้นครูโรจน์";
$a[1533]="ร้านป้าเล็ก";
$a[1534]="ร้านข้าวถ้วย";
$a[1535]="สบาย";
$a[1536]="คุณจะริง ทองสง";
$a[1537]="ครัววิชาญ";
$a[1538]="พี่ติ๋งตามสั่ง";
$a[1539]="ป้ากอบอาหารตามสั่ง";
$a[1540]="ข้าวแกงพี่แอ๊ะ";
$a[1541]="คุณประเสริฐ แมกฉาย";
$a[1542]="บ้านอีสาน";
$a[1543]="สินทรัพย์อะไหล่";
$a[1544]="ลุงกิจ";
$a[1545]="ก๋วยจั๊บอัชลี";
$a[1546]="โกแก้ว";
$a[1547]="ร้านอีสาน-ตายาย";
$a[1548]="ตำหรับมุสลิม2";
$a[1549]="ร้านโรฮานาต้มยำ";
$a[1550]="โดนใจปลายทาง";
$a[1551]="ร้านทิพย์";
$a[1552]="คุณนิราวัลย์ กว้างใสกรุงสระ";
$a[1553]="คุณณัฐกานด์ จาราด";
$a[1554]="ข้าวหมูแดงจุ้ยซิน";
$a[1555]="อาเหลียง";
$a[1556]="คุณกาญจนา สีมาทรัพย์";
$a[1557]="น้องขวัญข้าว";
$a[1558]="เจ๊ขอม";
$a[1559]="ปีนังก๋วยเตี๋ยวน้ำ";
$a[1560]="บัวแก้ว";
$a[1561]="คุณพี่เล็ก59";
$a[1562]="จ่าศักดิ์";
$a[1563]="ร้านปากหมาชวนชิม";
$a[1564]="ร้านเปรี้ยวปาก";
$a[1565]="ตำรับมุสลิม";
$a[1566]="อ่อนเอี่ยม";
$a[1567]="เอเซียโภชนา";
$a[1568]="เชอรี่(ชิลลี่)";
$a[1569]="เซาะฮึ้ง2";
$a[1570]="ข้าวขาหมูเบตง";
$a[1571]="หลีฟ้านเตียน";
$a[1572]="อีสานตามสั่ง";
$a[1573]="บะหมี่หมูแดง";
$a[1574]="ก๋วยเตี๋ยวราดหน้าราโด";
$a[1575]="เปรียวส้มตำ";
$a[1576]="อภิชาติข้าวหมูแดง";
$a[1577]="ต้าเหยินเบตง";
$a[1578]="หมี่เป็ดสาย3";
$a[1579]="คอหนังแต้เตี้ยม";
$a[1580]="ก๋วยเตี๋ยวเรืออนุสาวรีย์";
$a[1581]="ฮั้วหลี";
$a[1582]="คุณแดง";
$a[1583]="ร้านอาหารหยก";
$a[1584]="บะหมี่กวางตุ้ง";
$a[1585]="ข้าวแกง191";
$a[1586]="ก๋วยเตี๋ยวเรือโกชัย";
$a[1587]="นายตี๋เกาเหลาเลือดหมู(นาทวี)";
$a[1588]="จิตไท";
$a[1589]="โจ๊กหมูเกาเหลาใบตำลึง";
$a[1590]="ร้านเรา";
$a[1591]="ร้านโจ๊ก-นิด";
$a[1592]="ฟูไฑสเต็ก";
$a[1593]="ป้ายแดงตลาดใหม่";
$a[1594]="บะหมี่เป็ดตุ๋นตลาดใหม่";
$a[1595]="คุณกิติพงษ์ รนะนา";
$a[1596]="ก๋วยเตี๋ยวถนัดศรี";
$a[1597]="ราดหน้าโกอ้วน";
$a[1598]="โกอ้วน";
$a[1599]="ชาโต้ง";
$a[1600]="ร้านยินกิจ";
$a[1601]="หนานหยวน";
$a[1602]="ข้าวมันไก่ศุภบูรณ์";
$a[1603]="ข้าหมูแดงแสงศรี";
$a[1604]="คุณชติมณฑน ศิริสูตร";
$a[1605]="คุณปภาดา ตันติวัฒนกุล";
$a[1606]="ขนมจีนน้ำเงี้ยวแม่จัน";
$a[1607]="ก๋วยเตี๋ยวติดแอร์";
$a[1608]="ข้าวต้มปลา เจ้าเก่าไร้เทียมทาน";
$a[1609]="กุ๊กชัยติ่มซำ2";
$a[1610]="ร้านกุ้งคลุก";
$a[1611]="ครัวปอยฝ้านอาหารอีสาน";
$a[1612]="ร้านอาหารเหนือ";
$a[1613]="เซียง เซียง ซีโป้";
$a[1614]="กิมหล่น";
$a[1615]="เอเราะห์มัน";
$a[1616]="ร๊อกกี้มุสลิม";
$a[1617]="ก๋วยเตี๋ยวราโด";
$a[1618]="ไก่ทอดเดชา";
$a[1619]="บจก.อสุวัณโณ จำกัด";
$a[1620]="ข้าวมันไก่เบตง";
$a[1621]="ข้าวมันไก่โกหยง";
$a[1622]="ก๋วยเตี๋ยวเนื้อเปื้อย";
$a[1623]="ภูชงค์ข้าวมันไก่";
$a[1624]="ข้างแกงนุชรี";
$a[1625]="ข้าวแกงป้าประดับ";
$a[1626]="DEEP POINT";
$a[1627]="ร้านอาหารซิงกี่";
$a[1628]="เซาะฮึ้ง3";
$a[1629]="ต้าหม่าราชาเต้าหู้";
$a[1630]="ก๋วยจับน้ำข้น";
$a[1631]="หมั่นฉือบะกุ้แด้";
$a[1632]="รังนกใต้";
$a[1633]="ไทยซีฟู้ด";
$a[1634]="ถนัดศรี 3";
$a[1635]="ดาวเทียม";
$a[1636]="ร้านอาหารอ้า";
$a[1637]="ร้านอาหารถิ่นเอก";
$a[1638]="ร้านอาหารเวียงจันทร์";
$a[1639]="คุณนิพัทธ์ จิงวังสะ";
$a[1640]="ตั้งฮะเฮง";
$a[1641]="ถนัดศรี สุหฤท ลิขิตขจรนุวัฒน์";
$a[1642]="ถนัดศรี หาดใหญ่";
$a[1643]="มาเรียม";
$a[1644]="สุไลมาน 2";
$a[1645]="เตียจีเซ็ง";
$a[1646]="ทะเลทองซีฟู๊ด";
$a[1647]="บูรพารังนก";
$a[1648]="แซ่บ & นัว อาหารอีสานรสเด็ด";
$a[1649]="ไฉไลเบอร์เกอร์";
$a[1650]="แม่ตุ้ยข้าวแกงนครศรี";
$a[1651]="ร้านอาหารสถานีรถไฟ";
$a[1652]="เหยี่ยน";
$a[1653]="ผัดไทยน้องฝน";
$a[1654]="คุณเสาร์คำ ทาโสด";
$a[1655]="ร้านอาหารพี่แต๋ว";
$a[1656]="คุณรัชนี ชีวทวีทรัพย์";
$a[1657]="เซาะอึ้ง";
$a[1658]="สุมาตรา";
$a[1659]="น้องหญิง";
$a[1660]="แสงเพชรนครปฐม";
$a[1661]="มาราดี";
$a[1662]="คุณกานต์ฐิญา คชรัตน์";
$a[1663]="หาดใหญ่โภชนา";
$a[1664]="ซินซิน";
$a[1665]="ครัวกะมาลอง";
$a[1666]="ข้าวมันไก่ ตรัง";
$a[1667]="ก๋วยเตี๋ยวต้มยำมันกุ้ง";
$a[1668]="จิ้มจุ่มซุ้มสบายบุฟเฟ่ต์";
$a[1669]="ร้านก๋วยเตี๋ยวเรือหลานตาเพียร";
$a[1670]="Me Melon";
$a[1671]="ขนมจีนบ้านทองวงศ์";
$a[1672]="ก๋วยเตี๋ยวขลุกขลิก";
$a[1673]="คุณบุญชัย ธีระอกูล";
$a[1674]="เกตุเพ็ชรก๋วยเตี๋ยวไก่บ้าน";
$a[1675]="บะหมี่หนานหยวน";
$a[1676]="ตำแหลก";
$a[1677]="ร้านบ้านเปี่ยม";
$a[1678]="ร้านสวนข้าวแกง";
$a[1679]="ร้านก๋วยเตี๋ยวเครื่องในหมู";
$a[1680]="ร้านข้าวต้มภาคกลาง";
$a[1681]="ร้านป้าออง";
$a[1682]="ข้าวหมูทอดพี่ผอม";
$a[1683]="ร้านขนมจีนป้าชื่น";
$a[1684]="ก๋วยเตี๋ยวเฮียเปา";
$a[1685]="ข้าวมันไก่คลองเตย";
$a[1686]="ข้าวมันไก่(นายหมง)";
$a[1687]="บะหมี่ป๋าเทพ";
$a[1688]="HASHI";
$a[1689]="โชกุล";
$a[1690]="อิน ซี บาร์";
$a[1691]="กุ้งถังหาดใหญ่";
$a[1692]="ทีม แอนด์ ไท";
$a[1693]="ร้านโฟร์";
$a[1694]="อารีราดหน้ายอดผัก";
$a[1695]="อาม่าติ่มซำ";
$a[1696]="ร้านครูธศ";
$a[1697]="คุณสรัณย์ จันทร์ทรภาพ";
$a[1698]="ร้านอาหารไทย-เวียดนามทองพูน";
$a[1699]="ร้านฅนกับข้าว";
$a[1700]="บะหมี่ต้มยำ";
$a[1701]="ส้มตำเป้หนองคาย";
$a[1702]="Relex";
$a[1703]="ก๋วยเตี๋ยวหมูย่าง";
$a[1704]="ก๋วยเตี๋ยวท่าทอง";
$a[1705]="กระติ๊บ Kratip";
$a[1706]="กรุงเทพอพาร์ทเม้นท์";
$a[1707]="เจ๊ไหมเย็นตาโฟ";
$a[1708]="โชคเฮง";
$a[1709]="ร้านใกล้นภาลัยเพลส";
$a[1710]="ร้านไม้ฉำฉา";
$a[1711]="ครัวขุนแผน";
$a[1712]="คุณจรัญ เซ่งเอียง";
$a[1713]="พี่ออน";
$a[1714]="โกเงาะ";
$a[1715]="ร้านอาหารนกกรงหัวจุก";
$a[1716]="ร้านอิสลามข้าวหมกไก่";
$a[1717]="พี่เปีย";
$a[1718]="ส้มตำหัวพาน";
$a[1719]="คุณแดง พัฒโณ";
$a[1720]="ข้าวแกงเบญจรงค์";
$a[1721]="ร้านข้าวมันไก่ซอย6";
$a[1722]="ลุงพรรณ";
$a[1723]="ร้านอาหารอิสลาม";
$a[1724]="ร้านครัวคุณหนุ่ม";
$a[1725]="เจ๊เยาว์ เย็นตาโฟ";
$a[1726]="ศรีสุภา เมืองสุวรรณ";
$a[1727]="ลุงโอ๋";
$a[1728]="คุณรัตนา แซ่ฉิม";
$a[1729]="ร้านลูกชิ้นกลับเพชร";
$a[1730]="ร้านอาหารฟาตีฮะม์";
$a[1731]="ป้านีอาหารตามสั่ง";
$a[1732]="คุณนฤมล เพ็ชรคง";
$a[1733]="ร้านดาวอีสาน";
$a[1734]="ร้านป้าเมียด";
$a[1735]="อีสาน99";
$a[1736]="คุณพิมลพรรณ ใช่ภู่พิรัตน์";
$a[1737]="น่านน้ำ Happy Place";
$a[1738]="ชู้ดแซ่บ ปลาเผา & ปิ้งย่าง กะทะร้อน";
$a[1739]="ร้านเป่าปาก";
$a[1740]="The Zea food bar";
$a[1741]="ร้านข้าวแกงมงคล";
$a[1742]="คุณพรพิทย์ ชัยเทพ";
$a[1743]="ครัวปั้นทิพย์";
$a[1744]="ร้านเจ๊บ๊วย";
$a[1745]="ร้านก๋วยเตี๋ยวพี่ช้าง";
$a[1746]="ร้านข้าวต้มโกเซี้ย";
$a[1747]="99แสงทอง";
$a[1748]="สวนอาหารไม้เมือง";
$a[1749]="พี่ยุ ริมคลอง56";
$a[1750]="ไคโร";
$a[1751]="บะหมี่ทำเอง หมี่อาแปะ";
$a[1752]="เวทติ้งพ้อยท์";
$a[1753]="ร้านข้าวมันไก่บ้าน";
$a[1754]="ร้านข้าวมันไก่ ข้าวขาหมู";
$a[1755]="น้องไหม";
$a[1756]="ครัวพี่ยุริมคลอง";
$a[1757]="ร้าน กุ๊กพงษ์";
$a[1758]="ร้านข้าวแกง พี่ขอม พี่เขียม";
$a[1759]="ร้านโก๊ะBBบรา";
$a[1760]="ข้าวแกงชา-กาแฟ";
$a[1761]="คุณพเยาว์ อิทสร";
$a[1762]="อากง นครปฐม";
$a[1763]="ร้านข้าวหมูแดงชินกิจ";
$a[1764]="Star coffee & Bistro";
$a[1765]="โกหม่ำ";
$a[1766]="อาหารตามสั่งหัวสะพาน";
$a[1767]="ขวัญเรือน";
$a[1768]="หมูกรอบ หมูแดง โกคิม";
$a[1769]="Line  By  Line";
$a[1770]="ก๋วยเตี๋ยวตัวกลม";
$a[1771]="อีสานเพิ่มพูน อาหารตามสั่ง";
$a[1772]="บ้านไม้";
$a[1773]="ส้มตำย่าพร";
$a[1774]="ก๋วยเตี๋ยวนายแบงค์";
$a[1775]="โก้เปา";
$a[1776]="ข้าวมันไก่ผาสุข";
$a[1777]="สายสลามซูชิ";
$a[1778]="จิบชาในสวน2";
$a[1779]="ข้าง-ข้าง Beside'Pizza&Chill-out";
$a[1780]="3 แซ่บ";
$a[1781]="More44";
$a[1782]="พ่อหมีป่า B.B.Q";
$a[1783]="ฟินิชชุ";
$a[1784]="หญิง หญิง";
$a[1785]="อาม่าตีนไก่ซุปเปอร์";
$a[1786]="ครัวมุมสวน";
$a[1787]="ลุงจอห์น";
$a[1788]="ร้านสลัดบาร์ 108";
$a[1789]="ข.ไข่";
$a[1790]="เจี้ยนไฉข้าวมันไก่";
$a[1791]="หนานหยวน";
$a[1792]="จิ้มจุ่มหม้อเบอเร่อ";
$a[1793]="บริษัท เดอะวีคเอนเตอร์ จำกัด";
$a[1794]="ขนมจีนซาดิสซ์";
$a[1795]="น้องมาย";
$a[1796]="น้ำว้า";
$a[1797]="อาหารบินหลา";
$a[1798]="ลูกเหลียงอาหารตามสั่ง";
$a[1799]="สเต็กนายช่าง";
$a[1800]="ชมชงชา";
$a[1801]="เซจู ปิ้งย่าง ชาบู";
$a[1802]="ครัวธรรม";
$a[1803]="ไก่อ้วน";
$a[1804]="อาหารตามสั่งและเครื่องดื่ม";
$a[1805]="ร้านครัวกันเอง";
$a[1806]="ขนมจีนป้าสาว";
$a[1807]="ร้านข้าวแกงยายเจียร";
$a[1808]="ครัวมารา";
$a[1809]="บ้านผู้ใหญ่";
$a[1810]="เปา เปา หมี่หยกเป็ดย่าง";
$a[1811]="กุ๊กเสริฐ อาหารตามสั่ง ข้าวต้ม";
$a[1812]="ลมโชย(น้องใหม่)";
$a[1813]="ครัวเชฟ";
$a[1814]="ใบไผ่";
$a[1815]="ข้าวแกงพี่ตุ๋ม";
$a[1816]="ก๋วยเตี๋ยวเรือโก้ตุ๋ย";
$a[1817]="โดม 108";
$a[1818]="น้ำชาลุง-ป้า (เจ้าเก่า)";
$a[1819]="อาโก้ข้าวขาหมู";
$a[1820]="07.LUCKY ขนมหวานอาหารว่าง";
$a[1821]="KAI NA BAN & CHICKY CAFE";
$a[1822]="กัมบัตเตะซูชิ";
$a[1823]="กังฟู&ช้วนช้วน";
$a[1824]="ร้านโกอั้นเล้ง (KOAUNT LENG ZAP)";
$a[1825]="ร้านก๋วยเตี๋ยว";
$a[1826]="ร้านข้าวแกงป้าทุม";
$a[1827]="สถานีพารวย สาขา3";
$a[1828]="ร้านครัวลุงพงษ์";
$a[1829]="ติ่มซำ";
$a[1830]="ครัวน้องเนย";
$a[1831]="ชายสี่บะหมี่เกี๊ยว";
$a[1832]="กะณี";
$a[1833]="ร้านหลวงชา";
$a[1834]="ข้าวแกงแม่ประนอม";
$a[1835]="จัดเต็ม";
$a[1836]="เฉาโฉ่วหม่าล่า";
$a[1837]="สารคาม ลาบก้อย";
$a[1838]="ครัวมิตรภาพกาลเวลา";
$a[1839]="ครัวคุณหนิง";
$a[1840]="D.L.A.B. ดีแล็บ";
$a[1841]="บูรพาชาบู";
$a[1842]="ลัานนาตั้งตาตำ";
$a[1843]="ครัวทุ่งโดน";
$a[1844]="ไอย๊ะ ชาบู";
$a[1845]="ก๋วยเตี๋ยวต้มยำหมูย่าง";
$a[1846]="ข้าวแกงพี่อุไร";
$a[1847]="เตี๋ยวเรือไม่มีชื่อ (NO Name)";
$a[1848]="ข้าวหมูแดงแสงทอง";
$a[1849]="ก๋วยเตี๋ยวเย็นตาโฟปลาหมึกสด";
$a[1850]="ซุปเนื้อคูหู19";
$a[1851]="ศรีอาหารตามสั่ง";
$a[1852]="คุณณัฐนันท์ รัตนะ";
$a[1853]="ร้านเจ้ไก่";
$a[1854]="คุณพรพรรณ นิตโชติ";
$a[1855]="ก๋วยเตี๋ยวเรือชายจู";
$a[1856]="คุณศิรินาถ แซ่ลิ้ม";
$a[1857]="ลูกชิ้นปลาวังน้อย";
$a[1858]="ร้านลลดา รัตนนุสนธิ์";
$a[1859]="เล้ง";
$a[1860]="ก๋วยจั๊บนายเอ๋";
$a[1861]="ห้างหุ้นส่วน จำกัด เคนตะ หาดใหญ่";
$a[1862]="คุณสราวุฒิ รุจิรัตน์สวัสดิ์";
$a[1863]="ร้านปรานี";
$a[1864]="ก๋วยเตี๋ยวลูกชิ้น";
$a[1865]="ข้าวแกงกลางเมือง";
$a[1866]="อู๋ปลาเผา";
$a[1867]="หมูโบราณ";
$a[1868]="คุณวิเชียร เทียนทองใบ";
$a[1869]="น้ำเงินคาราโอเกะ";
$a[1870]="ก๋วยจับโบราณ";
$a[1871]="ข้าวแกงเจ๊แอ๊ด";
$a[1872]="สลัดไทย";
$a[1873]="ข้าวต้มเย็นใจ";
$a[1874]="เจ๊พร 110";
$a[1875]="ราดหน้าเจ๊น้อย";
$a[1876]="บ้านคุณปู่";
$a[1877]="ขนมจีนป้าชื่น";
$a[1878]="มุ่ยกี่โอชา";
$a[1879]="ร้านสวนหยก";
$a[1880]="ก๋วยเตี๋ยวชักธง";
$a[1881]="ข้าวต้มเจ๊เพ็ญ";
$a[1882]="ป้าเขียว";
$a[1883]="ข้าวขาหมูอาเก๋า";
$a[1884]="ข้าวมันไก่ปาร์ดัง";
$a[1885]="ราดหน้าโกฉ่อน";
$a[1886]="ก๋วยเตี๋ยวหางหมู";
$a[1887]="ราดหน้าเนื้อเด้ง";
$a[1888]="ก๋วยเตี๋ยวลูกชิ้นหมู(สูตรดั้งเดิม)";
$a[1889]="ครัวหย่งอาน";
$a[1890]="เต้ากั๊วเจ๊เอ็ง";
$a[1891]="โนราเล้งแซ่บหม้อไฟ";
$a[1892]="เจ้านายปูไข่";
$a[1893]="นิโคลัส";
$a[1894]="Tree Garden";
$a[1895]="ร้านฟินน์";
$a[1896]="คุณสุภา";
$a[1897]="ร้านป่าตองอาหารตามสั่ง";
$a[1898]="โกดอนก๋วยเตี๋ยวหมูต้มยำ";
$a[1899]="ก๋วยเตี๋ยวบ้านยาย";
$a[1900]="ก๋วยเตี๋ยวเอ็นหมู";
$a[1901]="ข้าวขาหมูโอปอ";
$a[1902]="เมนูสเต็ก";
$a[1903]="ชาววังลูกชิ้นปลาหมึก";
$a[1904]="ข้าวหมูแดงนายแบงค์";
$a[1905]="ชินกิจ";
$a[1906]="ข้าวขาหมูคู่แฝด";
$a[1907]="ข้าวมันไก่เจ๊ต้อย";
$a[1908]="ร้านอาหารนิยมรส";
$a[1909]="คุณชัด เพ็ชรมาลัย";
$a[1910]="ใช้เส้งฮวด";
$a[1911]="ร้านอาหารอิสลาม2";
$a[1912]="ร้านป้าบัว";
$a[1913]="ร้านคอฟฟี่โรตีบัน";
$a[1914]="ขาหมูฮากกา (จีนแคะ)";
$a[1915]="ร้านบานาน่าสเต็ก";
$a[1916]="โอซาก้า ราเมน";
$a[1917]="ข้าวขาหมูศิภาพัชร์";
$a[1918]="เติมอิ่ม";
$a[1919]="ร้านแสงทองเจ้าเก่า";
$a[1920]="ข้าวหมูทอดเจ๊ผอม";
$a[1921]="ข้าวต้มปลาอินทรีย์";
$a[1922]="อมรพันธ์";
$a[1923]="ก๋วยเตี๋ยวคุณเล็ก";
$a[1924]="นายสะอาด";
$a[1925]="ลูกชิ้นแสงทอง";
$a[1926]="คุณภิญโญ";
$a[1927]="เจ๊เล็กเย็นตาโฟ";
$a[1928]="โคกเสม็ดชุน";
$a[1929]="ข้าวแกงคุณไพ";
$a[1930]="หย่องซิ้ม หยั่น";
$a[1931]="เล่าอึ้งเย็นตาโฟ";
$a[1932]="ลูกชิ้นเอ็นเจ๊ฮุ้ย";
$a[1933]="ก๋วยจั๊บเป็ด";
$a[1934]="คุณสัมฤทธิ์";
$a[1935]="เล็กจานใหญ่";
$a[1936]="เย็นตาโพฮ่องกง";
$a[1937]="ข้าวหมูแดงศิษฐโล่ห์โภชนา";
$a[1938]="ข้าวหมูแดงซัมเม้ง";
$a[1939]="อ้วนบะกุแต้";
$a[1940]="ชินกิจ (สาขาซีกิมหยง)";
$a[1941]="คุณพนาภา นักการรอง";
$a[1942]="ร้านเหยี่ยนสุกี้หม้อไฟจีน";
$a[1943]="ครัวบ้านแก้ว";
$a[1944]="บริษัท หาดใหญ่ ซาชิมิ จำกัด";
$a[1945]="กุ๊กวิโรจน์";
$a[1946]="คุณวนิดา รัตนณรงค์กุล";
$a[1947]="กชพร";
$a[1948]="พิงพร";
$a[1949]="สวัสดีอีสานแซ่บ";
$a[1950]="คุณนุชรี เตชะกิจติขจร";
$a[1951]="หนึ่งขอนแก่น";
$a[1952]="ข้าวซอยเชียงใหม่";
$a[1953]="ข้าวต้มนายโบว์นครปฐม";
$a[1954]="คุณสมศรี ทะนะใจ";
$a[1955]="Cubs";
$a[1956]="ครัวอาอู๋";
$a[1957]="โกฝ่า";
$a[1958]="นายต้มยำ 2";
$a[1959]="คุณกันยา เมธาพานิช";
$a[1960]="โกช้าง";
$a[1961]="อาเหลียง ผัดไท หอยทอด";
$a[1962]="หัวปลาหม้อไฟ";
$a[1963]="ราดหน้าโกดำ";
$a[1964]="ครัวเกวลี";
$a[1965]="ร้านอาหารญี่ปุ่นกิริโก๊ะ";
$a[1966]="ร้านอาหารมุสลิมกะซะห์ 3";
$a[1967]="นายปกรณ์ จิโรจสินธุ์";
$a[1968]="ร้านแสงทอง";
$a[1969]="ข้าวต้มเซาะเอก";
$a[1970]="กรหมี่ไก่";
$a[1971]="ร้านบ้านก้ามปู หาดใหญ่";
$a[1972]="คุณแฟลต แซ่อี";
$a[1973]="ข้าวต้มซอย3";
$a[1974]="ชัยเจริญโอชา";
$a[1975]="หมี่เป็ดศิริวัฒน์";
$a[1976]="ข้าวแกงจำเนียร";
$a[1977]="เฮียอ้วนข้าวมันไก่";
$a[1978]="โชคดีแต้เตียม";
$a[1979]="ก๋วยเตี๋ยวซำกอ";
$a[1980]="ขนมจีนคลองเตย";
$a[1981]="ก๋วยเตี๋ยวเฉินหลง";
$a[1982]="คุณสมโภชน์ ถนอมสุข";
$a[1983]="กลันตัน";
$a[1984]="ร้านปลิงทะเล";
$a[1985]="เมืองไทย";
$a[1986]="เปาะเปี้ยะสดแสงจันทร์";
$a[1987]="สบายใจซีฟู๊ดเยาวราช";
$a[1988]="คุณสมฤดี";
$a[1989]="เพชรดวงพร";
$a[1990]="ร้านบะหมี่เป็ดเจ๊อ้วน(เจ้าเก่า)";
$a[1991]="ร้านเหมยเหมย";
$a[1992]="หลวงไข่ตามสั้ง";
$a[1993]="เจ๊วรรณ";
$a[1994]="เตี๋ยวเรือฮาร์ดคอร์";
$a[1995]="อาหารตามสั่งงามตา";
$a[1996]="ข้าวแกงสมชาย";
$a[1997]="ข้าวต้มรถแดง";
$a[1998]="ก๋วยเตี๋ยวเรืออนุสาวรีย์ 2";
$a[1999]="ร้านอาหารเจ๊แดง";
$a[2000]="ร้านอาหารซัลมา";
$a[2001]="บึงกาฬ หาดใหญ่ ลาบก้อย";
$a[2002]="ทิพย์นรินทร์";
$a[2003]="ร้านอาหารฮ่อกี่";
$a[2004]="ร้านกู้เกียรติ";
$a[2005]="ก๋วยจั๊บไก่";
$a[2006]="ก๋วยเตี๋ยวเรือเฉินหลง";
$a[2007]="ร้านพี่เล็ก";
$a[2008]="เซียข้าวต้มปลา";
$a[2009]="ลูกชิ้นปลาทำเองราชา";
$a[2010]="ร้านเจ๊ดา";
$a[2011]="บ่อเหล็ด";
$a[2012]="ธนาทิพย์ 1";

/*	
	$b[0]="mem1";
	$b[1]="member2";
	$b[2]="member3";
	$b[3]="member4";
	$b[4]="member5";
	$b[5]="member6";
*/
	
$c[0]="ขนมจีนน้ำยาปู สร้อยหลีเป๊ะ เขต8";
$c[1]="ร้านขนมจีนหน้าสวน";
$c[2]="ร้านขนมจีนนคร";
$c[3]="ขนมจีนแม่ญา";
$c[4]="ร้านขนมจีนบุฟเฟ่ต์  59";
$c[5]="ขนมจีนเมืองลุง";
$c[6]="ป้าเล็กขนมจีนเมืองคอน";
$c[7]="ขนมจีนลุงไข่ปากพนัง";
$c[8]="ขนมจีนยายพัน";
$c[9]="ขนมจีนเจ๊เดือน";
$c[10]="ข้าวแกงคนคอน ขนมจีนหม้อดิน";
$c[11]="โปรดใจขนมจีนเส้นสด";
$c[12]="ขนมจีนเจ๊แหม่ม";
$c[13]="ขนมจีนอิสลาม";
$c[14]="ร้านขนมจีน";
$c[15]="ขนมจีนรสเด็ด 10 ตุลา";
$c[16]="ขนมจีนป้าชื่น สาขา 3";
$c[17]="ขนมจีนแม่สุ";
$c[18]="ขนมจีนหน้าสวน";
$c[19]="ขนมจีนโกเปียก";
$c[20]="ร้านขนมจีนเส้นสดนวลแก้ว";
$c[21]="ขนมจีนมือถือ";
$c[22]="ร้านขนมจีนท่าวัง";
$c[23]="ขนมจีนพี่นิต";
$c[24]="หลวงทีปขนมจีน";
$c[25]="ขนมจีนป้าแหม่ม";
$c[26]="ขนมจีนขุนศรีปากพนัง";
$c[27]="ขนมจีนป้าฮวย";
$c[28]="ขนมจีนน้ำเงี้ยวแม่จัน";
$c[29]="ขนมจีนบ้านทองวงศ์";
$c[30]="ร้านขนมจีนป้าชื่น";
$c[31]="ขนมจีนซาดิสซ์";
$c[32]="ขนมจีนป้าสาว";
$c[33]="ขนมจีนป้าชื่น";
$c[34]="ขนมจีนคลองเตย";
$c[35]="บ้านกินเส้น";
$c[36]="โปรดใจขนมจีนเส้นสด";
$c[37]="ร้านกินเส้น";
$c[38]="ร้านขนมจีนเส้นสดนวลแก้ว";
	
$d[0]="The Hopster Cafe'";
$d[1]="Sixteen house Shabu & Steak";
$d[2]="Bananasteak";
$d[3]="สเต็ก๑๐๐ล้าน";
$d[4]="หจก. มิสเตอร์ สเต็ก";
$d[5]="ร้านสเต็กเด็กแนว";
$d[6]="สเต็กไฟแดง";
$d[7]="สเต็กเป็นไทสาขา3";
$d[8]="สเต็กจ๋า";
$d[9]="ร้านไพลินสเต็กเฮ้าส์";
$d[10]="สเต็ก by ซิทนี่ ช่องเขา";
$d[11]="เมนูสเต็ก 2";
$d[12]="มาลองสเต็ก";
$d[13]="สเต็กตาหวาน";
$d[14]="สเต็กโชกุล";
$d[15]="ฟูไฑสเต็ก";
$d[16]="สเต็กนายช่าง";
$d[17]="เมนูสเต็ก";
$d[18]="ร้านบานาน่าสเต็ก";

$e[0]="ยิ่งเฮ็งส้มตำเรือนหนองคาย";
$e[1]="ร้านvipส้มตำclub(สาขาบ้านพรุ)";
$e[2]="ส้มตำก้ะฉ้ะ";
$e[3]="ส้มตำยำแซ่บ";
$e[4]="ร้านส้มตำสุดา";
$e[5]="ส้มตำป้านุช";
$e[6]="ร้านส้มตำ เป็ดย่าง คูเมือง";
$e[7]="ส้มตำถาด";
$e[8]="ส้มตำพี่เมือง";
$e[9]="ร้านส้มตำชิด-ชล";
$e[10]="ร้านส้มตำพี่แอม";
$e[11]="ร้านส้มตำแซ่บเวอร์";
$e[12]="ร้านวรรณส้มตำ";
$e[13]="ส้มตำชัยภูมิ";
$e[14]="ร้านส้มตำป้าติ่ว";
$e[15]="ร้านส้มตำป้าเพชร";
$e[16]="ส้มตำคอหมูย่างเจ๊ฟอง";
$e[17]="ร้านส้มตำพี่ปู";
$e[18]="ร้านส้มตำหลวงทีป";
$e[19]="ส้มตำสองภู";
$e[20]="ครัวส้มตำ";
$e[21]="ส้มตำซีฟู๊ด";
$e[22]="พี่แหลมส้มตำ";
$e[23]="ส้มตำป้าดวน";
$e[24]="ร้านส้มตำป้าพร";
$e[25]="ร้านส้มตำพี่จวบ";
$e[26]="ส้มตำรำซิ้ง";
$e[27]="ส้มตำหน้าสวน";
$e[28]="ส้มตำยอดมะพร้าว";
$e[29]="ร้านส้มตำกะฉ๊";
$e[30]="ธิดาส้มตำ";
$e[31]="ส้มตำครกทอง";
$e[32]="ส้มตำคาเฟ่";
$e[33]="ส้มตำครกทองสาขา 2";
$e[34]="ส้มตำป้าเพลิน";
$e[35]="ส้มตำ";
$e[36]="ส้มตำป้าพรรณ";
$e[37]="เปรียวส้มตำ";
$e[38]="ส้มตำเป้หนองคาย";
$e[39]="ส้มตำหัวพาน";
$e[40]="ส้มตำย่าพร";
$e[41]="ร้านอาหาร เหนือ อีสาน";
$e[42]="อีสานบ้านพรุตำนัว";
$e[43]="อีสานชวนชิม";
$e[44]="ร้านเผ็ดอีสาน";
$e[45]="เตอร์อีสานแซบ";
$e[46]="ครัวโกดำอาหารอีสาน";
$e[47]="ร้านแซ่บอีสาน (หัวรั้ว)";
$e[48]="แก่นนครอีสาน";
$e[49]="ร้านครัวลุงบูลย์ตาชั่งอีสานใต้";
$e[50]="ร้านตาชั่งอีสานใต้";
$e[51]="ร้านอีสานกาญจนา";
$e[52]="ครัวอีสานใต้";
$e[53]="ร้านตาชั่งอีสาน (ท่าเคียน)";
$e[54]="รีานสุดยอดอีสาน";
$e[55]="ร้านก๋วยเตี๋ยวอีสาน";
$e[56]="ร้านอีสานบ้านใต้";
$e[57]="ตำรับอีสาน";
$e[58]="ร้านอีสานกันเอง";
$e[59]="ครัวตาวันอีสานรสแซ่บ2";
$e[60]="อีสานรสแซ่บ";
$e[61]="ร้านอีสานรสเด็ด";
$e[62]="ครัวอีสาน";
$e[63]="รสอีสาน";
$e[64]="ร้านอาหารอีสานริมคลอง";
$e[65]="ร้านซุ้มอีสาน";
$e[66]="ร้านลาบอีสาน";
$e[67]="อาหารอีสานลาบร้อยเอ็ด";
$e[68]="อีสานรสแซบ";
$e[69]="มุสลิมอีสาน";
$e[70]="แซบอีสาน";
$e[71]="แซ่บนัวครัวอีสาน";
$e[72]="แจ่วอีสาน";
$e[73]="นครอีสาน";
$e[74]="อีสานโต้รุ่ง";
$e[75]="บ้านอีสาน";
$e[76]="ร้านอีสาน-ตายาย";
$e[77]="อีสานตามสั่ง";
$e[78]="ครัวปอยฝ้านอาหารอีสาน";
$e[79]="แซ่บ & นัว อาหารอีสานรสเด็ด";
$e[80]="ร้านดาวอีสาน";
$e[81]="อีสาน99";
$e[82]="อีสานเพิ่มพูน อาหารตามสั่ง";
$e[83]="สวัสดีอีสานแซ่บ";
$e[84]="เอาดี้ย์ เมี่ยงปลาเผา";
$e[85]="ร้านอาหารทะเลเผาและตามสั่งเรินเรา";
$e[86]="Sea ซีฟู๊ด ทะเลเผา";
$e[87]="ร้านครัวครูสัน ปลาเผา";
$e[88]="เปิ้ล ปลาเผาสมุนไพร";
$e[89]="แม่เบญ ปลาเผา";
$e[90]="หอมปลาเผา88";
$e[91]="แม่ประนอมปลาเผา";
$e[92]="กฤษณาปลาเผา(ครัวสิเหรง)";
$e[93]="ลุงรอกปลาเผา";
$e[94]="ชู้ดแซ่บ ปลาเผา & ปิ้งย่าง กะทะร้อน";
$e[95]="อู๋ปลาเผา";

	
$f[0]="ก๋วยเตี๋ยวเรือป้าแต๋ว2";
$f[1]="ร้านก๋วยเตี๋ยวเรืออนุเสาวรีย์สาขา2";
$f[2]="ก๋วยเตี๋ยวต้มยำ ต้นท้อน";
$f[3]="ร้านก๋วยเตี๋ยวเรือเป็นต่อ";
$f[4]="ร้านเด็ดดวง ก๋วยเตี๋ยวไก่แต่แรก";
$f[5]="ก๋วยเตี๋ยวเรือลุงรูญ 2";
$f[6]="ก๋วยเตี๋ยวดู๋ดี๋";
$f[7]="ร้าน พี่ปุ๊ก๋วยเตี๋ยวหมูเย็นตาโพ";
$f[8]="ก๋วยเตี๋ยวหมูโบราณ";
$f[9]="ร้าน ก๋วยเตี๋ยวเรือในตำนาน";
$f[10]="ก๋วยเตี๋ยวเรือหมูน้ำตก";
$f[11]="ก๋วยเตี๋ยวเรือกะลา";
$f[12]="ก๋วยเตี๋ยวเรือนารา";
$f[13]="ร้านก๋วยเตี๋ยวเรือโอฬาร";
$f[14]="ร้านก๋วยเตี๋ยวต้มยำน้ำใส่";
$f[15]="ก๋วยเตี๋ยวเรือเป็นต่อ";
$f[16]="ร้านก๋วยเตี๋ยวอัยย๊ะ หรอยจัง";
$f[17]="ก๋วยเตี๋ยวต้มยำในชอย";
$f[18]="ก๋วยเตี๋ยวจัมโบ้";
$f[19]="ก๋วยเตี๋ยวไก่ตุ๋น";
$f[20]="ก๋วยเตี๋ยวปลาตอด";
$f[21]="ร้านก๋วยเตี๋ยวบิ๊กปู";
$f[22]="ก๋วยเตี๋ยวเรือโกตุ๋ย";
$f[23]="ก๋วยเตี๋ยวเรือเต็งหนึ่ง";
$f[24]="ก๋วยเตี๋ยวเรือพี่พิศ";
$f[25]="ร้านก๋วยเตี๋ยวป้าอ้วน";
$f[26]="ก๋วยเตี๋ยวเรือหลานตาเพียร";
$f[27]="ก๋วยเตี๋ยวนายโย่ง";
$f[28]="เอี่ยวเฮง ก๋วยเตี๋ยวไก่ตุ๋น";
$f[29]="ก๋วยเตี๋ยวดู๋ดี๋ เติมวันนงเยาว์";
$f[30]="ไอแอม ก๋วยเตี๋ยวเรือ";
$f[31]="ก๋วยเตี๋ยวต้มยำมันกุ้ง (ฮาลา)";
$f[32]="ก๋วยเตี๋ยวหางหมู สาขา2";
$f[33]="ก๋วยเตี๋ยวผักหวาน";
$f[34]="ก๋วยเตี๋ยวเรืออยุธยา";
$f[35]="ก๋วยเตี๋ยวโอฬาร สาขา 8";
$f[36]="ก๋วยเตี๋ยวเรือ ณ.คอน";
$f[37]="ก๋วยเตี๋ยวชากังราว";
$f[38]="แทนทำก๋วยเตี๋ยวปลา";
$f[39]="ก๋วยเตี๋ยวมือสอง";
$f[40]="แม่พร ก๋วยเตี๋ยวไก่โบราณ";
$f[41]="ก๋วยเตี๋ยวท้าพิสูจน์";
$f[42]="ร้านก๋วยเตี๋ยวเรือซากีรีน";
$f[43]="345 ก๋วยเตี๋ยวเรือ";
$f[44]="ก๋วยเตี๋ยวเจ๊แกละ";
$f[45]="ร้านก๋วยเตี๋ยวเรือต่อชาม";
$f[46]="ก๋วยเตี๋ยวเรือในสวน";
$f[47]="ก๋วยเตี๋ยวเรือ ครูหมู รสเด็ด";
$f[48]="ก๋วยเตี๋ยวลุงชาชักธง";
$f[49]="คุณวิวิ ก๋วยเตี๋ยวเรือเมย์";
$f[50]="ก๋วยเตี๋ยวช้าง";
$f[51]="ก๋วยเตี๋ยวลุงหงบ";
$f[52]="ร้านก๋วยเตี๋ยวเรือแม่พร";
$f[53]="ร้านก๋วยเตี๋ยวเรืออยุธยา";
$f[54]="ก๋วยเตี๋ยวเรือ อาหารตามสั่ง";
$f[55]="ร้านก๋วยเตี๋ยวหัวโค้ง";
$f[56]="ก๋วยเตี๋ยวเรือ";
$f[57]="ก๋วยเตี๋ยวเรือคลองชล";
$f[58]="รุ่งอยุธยา ก๋วยเตี๋ยวน้ำตก";
$f[59]="ก๋วยเตี๋ยวเรือหมูน้ำตก";
$f[60]="ร้านนิ่มก๋วยเตี๋ยว";
$f[61]="ก๋วยเตี๋ยวไก่ตุ๋นคุณปลา";
$f[62]="ก๋วยเตี๋ยวกูฟู";
$f[63]="ก๋วยเตี๋ยวแซบเวอร์";
$f[64]="ร้านก๋วยเตี๋ยวอีสาน";
$f[65]="ก๋วยเตี๋ยวหมูทุบ";
$f[66]="ก๋วยเตี๋ยวเรือ 10 บาท";
$f[67]="ร้านเจ๊อ้วนก๋วยเตี๋ยวเป็ด";
$f[68]="ก๋วยเตี๋ยว2พี่น้อง";
$f[69]="ก๋วยเตี๋ยวเหล็กขูดโบราณ";
$f[70]="Super Bowl ก๋วยเตี๋ยวหมูต้มยำมะนาว";
$f[71]="ก๋วยเตี๋ยวต้มยำมังกรซ่า";
$f[72]="ร้านก๋วยเตี๋ยวหางหมู";
$f[73]="ร้านก๋วยเตี๋ยวลุงเรือง";
$f[74]="ร้านก๋วยเตี๋ยวเจ๊ฮวน";
$f[75]="ก๋วยเตี๋ยวลูกชิ้นปลา เจ้เฮี้ยง";
$f[76]="ร้านก๋วยเตี๋ยวสุโขทัย";
$f[77]="ก๋วยเตี๋ยวหมูตุ๋น";
$f[78]="ร้านก๋วยเตี๋ยวเรือเมย์";
$f[79]="ร้านก๋วยเตี๋ยวเป่าปาก";
$f[80]="ร้านก๋วยเตี๋ยวหมูราดหน้าปักธง";
$f[81]="เจ้ตุ๋นก๋วยเตี๋ยวน้ำตก";
$f[82]="ร้านก๋วยเตี๋ยวรถไฟ";
$f[83]="ร้านก๋วยเตี๋ยวพิษณุโลก";
$f[84]="ก๋วยเตี๋ยวเรือเมย์ สาขาทุ่งลุ่ง";
$f[85]="ร้านภัทรพกฤตก๋วยเตี๋ยวจัมโบ้สูตรสุโ";
$f[86]="ก๋วยเตี๋ยวเรือหน้าวัดคลองแห";
$f[87]="ร้านก๋วยเตี๋ยวหมู เพ็ชรสุทธิ์";
$f[88]="ก๋วยเตี๋ยวแม่ผักระยอง";
$f[89]="ก๋วยเตี๋ยวเรือลพบุรีราเมศวร์";
$f[90]="ป้าทัยก๋วยเตี๋ยวน้ำใส-ต้มยำ";
$f[91]="ข้าวมันไก่ ก๋วยเตี๋ยวเนื้อเปื่อย";
$f[92]="ก๋วยเตี๋ยวเย็นตาโฟ";
$f[93]="ก๋วยเตี๋ยวหล่มสัก";
$f[94]="ก๋วยเตี๋ยวมังกร";
$f[95]="ก๋วยเตี๋ยวเรือเจ๊เดือน";
$f[96]="เจ๊ต้อยก๋วยเตี๋ยวเรือ";
$f[97]="ก๋วยเตี๋ยวเรือโอฬาร สาขา 5";
$f[98]="ก๋วยเตี๋ยวป้าดา";
$f[99]="ร้านก๋วยเตี๋ยวราดหน้าราโดสาขา5";
$f[100]="ก๋วยเตี๋ยวหมูเด้ง";
$f[101]="ร้านปิ่นอนงค์ก๋วยเตี๋ยวเรือ";
$f[102]="ก๋วยเตี๋ยวเรือ เด้ง-แซ่บ";
$f[103]="ก๋วยเตี๋ยวไม้เขียว";
$f[104]="โกต่าย ก๋วยเตี๋ยวหมู ชามยักษ์";
$f[105]="ก๋วยเตี๋ยวป้าใจ";
$f[106]="ก๋วยเตี๋ยวหางหมู";
$f[107]="เอ็น เอ็น ก๋วยเตี๋ยวหมูทุบ";
$f[108]="ร้านก๋วยเตี๋ยววังชะโอน";
$f[109]="ก๋วยเตี๋ยวเรือโอฬาร";
$f[110]="ร้านก๋วยเตี๋ยวลุงโชค";
$f[111]="ร้านก๋วยเตี๋ยวป้านุช";
$f[112]="เรือนตะวัน ก๋วยเตี๋ยวไก่";
$f[113]="ก๋วยเตี๋ยวมะระ";
$f[114]="ก๋วยเตี๋ยวหางหมู";
$f[115]="ก๋วยเตี๋ยวหมูโกยุทธ";
$f[116]="ก๋วยเตี๋ยวเรือสูตรโบราณ";
$f[117]="ก๋วยเตี๋ยวต้มยำ2";
$f[118]="ก๋วยเตี๋ยวเย็นตาโฟป้าดาว";
$f[119]="ก๋วยเตี๋ยวจั๊บ";
$f[120]="ก๋วยเตี๋ยวเต็มเหนี่ยว";
$f[121]="เอกก๋วยเตี๋ยวหมูต้มยำ";
$f[122]="ก๋วยเตี๋ยวยายแผ้ว";
$f[123]="ก๋วยเตี๋ยวชามใหญ่";
$f[124]="ก๋วยเตี๋ยวเรือวงเวียน";
$f[125]="เจ๊หมวยก๋วยเตี๋ยวเย็นตาโฟรสเด็ด";
$f[126]="เจ๊เฮียงก๋วยเตี๋ยว";
$f[127]="ก๋วยเตี๋ยวพิน";
$f[128]="ก๋วยเตี๋ยวเรืออยุธยา";
$f[129]="ก๋วยเตี๋ยวเรือเร็ว";
$f[130]="ก๋วยเตี๋ยวหมู";
$f[131]="ก๋วยเตี๋ยวแชมป์";
$f[132]="ก๋วยเตี๋ยวพาเพลิน";
$f[133]="ก๋วยเตี๋ยวต้มยำกุ้ง มะนาวไข่หวาน";
$f[134]="ก๋วยเตี๋ยวฟัตฮียา";
$f[135]="ก๋วยเตี๋ยวเรือน้ำฟ้า";
$f[136]="ก๋วยเตี๋ยวเรือ";
$f[137]="ปีนังก๋วยเตี๋ยวน้ำ";
$f[138]="ก๋วยเตี๋ยวราดหน้าราโด";
$f[139]="ก๋วยเตี๋ยวเรืออนุสาวรีย์";
$f[140]="ก๋วยเตี๋ยวเรือโกชัย";
$f[141]="ก๋วยเตี๋ยวถนัดศรี";
$f[142]="ก๋วยเตี๋ยวติดแอร์";
$f[143]="ก๋วยเตี๋ยวราโด";
$f[144]="ก๋วยเตี๋ยวเนื้อเปื้อย";
$f[145]="ก๋วยเตี๋ยวต้มยำมันกุ้ง";
$f[146]="ร้านก๋วยเตี๋ยวเรือหลานตาเพียร";
$f[147]="ก๋วยเตี๋ยวขลุกขลิก";
$f[148]="เกตุเพ็ชรก๋วยเตี๋ยวไก่บ้าน";
$f[149]="ร้านก๋วยเตี๋ยวเครื่องในหมู";
$f[150]="ก๋วยเตี๋ยวเฮียเปา";
$f[151]="ก๋วยเตี๋ยวหมูย่าง";
$f[152]="ก๋วยเตี๋ยวท่าทอง";
$f[153]="ร้านก๋วยเตี๋ยวพี่ช้าง";
$f[154]="ก๋วยเตี๋ยวตัวกลม";
$f[155]="ก๋วยเตี๋ยวนายแบงค์";
$f[156]="ก๋วยเตี๋ยวเรือโก้ตุ๋ย";
$f[157]="ร้านก๋วยเตี๋ยว";
$f[158]="ก๋วยเตี๋ยวต้มยำหมูย่าง";
$f[159]="ก๋วยเตี๋ยวเย็นตาโฟปลาหมึกสด";
$f[160]="ก๋วยเตี๋ยวเรือชายจู";
$f[161]="ก๋วยเตี๋ยวลูกชิ้น";
$f[162]="ก๋วยเตี๋ยวชักธง";
$f[163]="ก๋วยเตี๋ยวหางหมู";
$f[164]="ก๋วยเตี๋ยวลูกชิ้นหมู(สูตรดั้งเดิม)";
$f[165]="โกดอนก๋วยเตี๋ยวหมูต้มยำ";
$f[166]="ก๋วยเตี๋ยวบ้านยาย";
$f[167]="ก๋วยเตี๋ยวเอ็นหมู";
$f[168]="ก๋วยเตี๋ยวคุณเล็ก";
$f[169]="ก๋วยเตี๋ยวซำกอ";
$f[170]="ก๋วยเตี๋ยวเฉินหลง";
$f[171]="ก๋วยเตี๋ยวเรืออนุสาวรีย์ 2";
$f[172]="ก๋วยเตี๋ยวเรือเฉินหลง";
$f[173]="ก๋วยจั๊บไก่ตุ๋นยาจีนลุงสิทธิ์";
$f[174]="ก๋วยจั๊บ คนแซ่แต้";
$f[175]="40 ก๋วยจั๊บ";
$f[176]="ก๋วยจั๊บไก่";
$f[177]="ร้านก๋วยจั๊บป้าไพ";
$f[178]="ก๋วยจั๊บไก่";
$f[179]="ก๋วยจั๊บอัชลี";
$f[180]="ก๋วยจั๊บนายเอ๋";
$f[181]="ก๋วยจั๊บเป็ด";
$f[182]="ก๋วยจั๊บไก่";
$f[183]="ร้านลักกี้นู้ดเดิ้ล";
$f[184]="ร้านเย็นตาโฟเจ้เพชร";
$f[185]="เจ้ไหมเย็นตาโฟ สาขา2";
$f[186]="ร้านบังหลงเย็นตาโฟทะเล";
$f[187]="เย็นตาโฟรสเด็ด";
$f[188]="ร้านเดฟเย็นตาโฟ";
$f[189]="ร้านเย็นตาโฟรสเด็ด";
$f[190]="เจ๊แดง เย็นตาโฟ";
$f[191]="ร้านมาลัยเย็นตาโฟ";
$f[192]="ร้านเย็นตาโฟทุ่งลุง";
$f[193]="เย็นตาโฟ";
$f[194]="ก๋วยเตี๋ยวเย็นตาโฟ";
$f[195]="ร้านหมูหมูเย็นตาโฟ";
$f[196]="ร้านเย็นตาโฟบัณฑิต";
$f[197]="ร้านเย็นตาโฟ";
$f[198]="ก๋วยเตี๋ยวเย็นตาโฟป้าดาว";
$f[199]="เย็นตาโฟ";
$f[200]="เจ๊หมวยก๋วยเตี๋ยวเย็นตาโฟรสเด็ด";
$f[201]="ร้านเย็นตาโฟเกาะเสือ";
$f[202]="บิ๊กปูเย็นตาโฟ";
$f[203]="เจ๊ไหมเย็นตาโฟ";
$f[204]="เจ๊เยาว์ เย็นตาโฟ";
$f[205]="ก๋วยเตี๋ยวเย็นตาโฟปลาหมึกสด";
$f[206]="เจ๊เล็กเย็นตาโฟ";
$f[207]="เล่าอึ้งเย็นตาโฟ";
$f[208]="ก๋วยเตี๋ยวต้มยำ ต้นท้อน";
$f[209]="ซ้อ7ก๊วยเตี๋ยวต้มยำรสเด็ด";
$f[210]="ร้านก๋วยเตี๋ยวต้มยำน้ำใส่";
$f[211]="ก๋วยเตี๋ยวต้มยำในชอย";
$f[212]="เตี๋ยวยิ้ม ต้มยำ";
$f[213]="ก๋วยเตี๋ยวต้มยำมันกุ้ง (ฮาลา)";
$f[214]="Super Bowl ก๋วยเตี๋ยวหมูต้มยำมะนาว";
$f[215]="ก๋วยเตี๋ยวต้มยำมังกรซ่า";
$f[216]="ป้าทัยก๋วยเตี๋ยวน้ำใส-ต้มยำ";
$f[217]="ก๋วยเตี๋ยวต้มยำ2";
$f[218]="เอกก๋วยเตี๋ยวหมูต้มยำ";
$f[219]="ก๋วยเตี๋ยวต้มยำกุ้ง มะนาวไข่หวาน";
$f[220]="ร้านโรฮานาต้มยำ";
$f[221]="ก๋วยเตี๋ยวต้มยำมันกุ้ง";
$f[222]="บะหมี่ต้มยำ";
$f[223]="ก๋วยเตี๋ยวต้มยำหมูย่าง";
$f[224]="โกดอนก๋วยเตี๋ยวหมูต้มยำ";
$f[225]="นายต้มยำ 2";
	
	
$g[0]="Sixteen house Shabu & Steak";
$g[1]="ร้านชาบูขาวเเดง";
$g[2]="ซีบาร์ ชาบู บุฟเฟ่แกรนด์";
$g[3]="ร้านชาบู mix";
$g[4]="Family ชาบู";
$g[5]="เคลิ้มชาบูหาดใหญ่";
$g[6]="ชาบู ปิ้งย่าง โกตี๋";
$g[7]="ถึงพริกถึงขิงชาบู";
$g[8]="มาตะ ชาบู";
$g[9]="เซจู ปิ้งย่าง ชาบู";
$g[10]="บูรพาชาบู";
$g[11]="ไอย๊ะ ชาบู";

	$h[0]="24/25 ตามสั่ง24ชั่วโมง";
$h[1]="ตำตามสั่ง";
$h[2]="ป้าส้มอาหารตามสั่ง";
$h[3]="ร้านอาหารตามสั่งรวมมิตรบ้านพรุ";
$h[4]="ป้านีอาหารตามสั่ง";
$h[5]="โก้ชีพอาหารตามสั่ง";
$h[6]="ครัวป้าปูอาหารตามสั่ง";
$h[7]="ร้านอาหารทะเลเผาและตามสั่งเรินเรา";
$h[8]="OLD CASTLE (ข้าวแกง อาหารตามสั่ง)";
$h[9]="ข้าวแกงพี่ไก่ และอาหารตามสั่ง";
$h[10]="พี่รมย์ อาหารตามสั่ง";
$h[11]="ครัวลุงถาวร อาหารตามสั่ง";
$h[12]="ร้านพี่นาตอาหารตามสั่ง";
$h[13]="ลูกคนตรัง ผัดไทอาหารตามสั่ง";
$h[14]="ก๋วยเตี๋ยวเรือ อาหารตามสั่ง";
$h[15]="เจ๊โสอาหารตามสั่ง";
$h[16]="ป้านาอาหารตามสั่ง";
$h[17]="เจ๊ไรอาหารตามสั่ง";
$h[18]="ลีลาตามสั่ง";
$h[19]="ร้านเจ้ดา อาหารตามสั่ง";
$h[20]="เจี๊นบโภชนา อาหารตามสั่ง";
$h[21]="ทำหรอย ตามสั่ง";
$h[22]="ร้านตามสั่งจ่า";
$h[23]="iร้านอาหารตามสั่ง";
$h[24]="อิ่มอร่อย ตามสั่ง";
$h[25]="ทิเบต อาหารตามสั่ง";
$h[26]="อาหารตามสั่งหัวสะพาน";
$h[27]="ข้าวแกงอาหารตามสั่งคลองแห";
$h[28]="พี่ไพอาหารตามสั่ง";
$h[29]="พี่สาวอาหารตามสั่ง";
$h[30]="ดินดีซีฟู๊ดอาหารตามสั่ง";
$h[31]="ร้านป้าบัวอาหารตามสั่ง";
$h[32]="ตุ๊กตุ๊กอาหารตามสั่ง";
$h[33]="น้องจูนดีอาหารตามสั่ง";
$h[34]="พี่นีย์อาหารตามสั่ง";
$h[35]="พี่สาวอาหารตามสั่ง";
$h[36]="พี่เล็กอาหารตามสั่ง";
$h[37]="โกวุธอาหารตามสั่ง";
$h[38]="ปุ่น (อาหารตามสั่ง)";
$h[39]="เจ๊หมูตามสั่ง";
$h[40]="ร้านพี่กอล์ฟตามสั่ง";
$h[41]="RED ตามสั่ง";
$h[42]="พี่ติ๋งตามสั่ง";
$h[43]="ป้ากอบอาหารตามสั่ง";
$h[44]="อีสานตามสั่ง";
$h[45]="ป้านีอาหารตามสั่ง";
$h[46]="อาหารตามสั่งหัวสะพาน";
$h[47]="อีสานเพิ่มพูน อาหารตามสั่ง";
$h[48]="ลูกเหลียงอาหารตามสั่ง";
$h[49]="อาหารตามสั่งและเครื่องดื่ม";
$h[50]="กุ๊กเสริฐ อาหารตามสั่ง ข้าวต้ม";
$h[51]="ศรีอาหารตามสั่ง";
$h[52]="ร้านป่าตองอาหารตามสั่ง";
$h[53]="อาหารตามสั่งงามตา";
$h[54]="ร้านข้าวหอม ข้าวตัง";
$h[55]="ร้านข้าวหอม ข้าวตัง";
$h[56]="ข้าวแกง ป้านงค์";
$h[57]="ร้านเจ้จูข้าวหมูทอด";
$h[58]="ร้านข้าวแกงบ้านชั้น";
$h[59]="ร้านข้าวแกงเพื่อชีวิต";
$h[60]="ร้านข้าวมันไก่";
$h[61]="ข้าวต้มทรงเครื่อง";
$h[62]="ร้านเพชรข้าวราดแกง";
$h[63]="ร้านข้าวแกงฅนโนด";
$h[64]="ข้าวขาหมูลุงภาพ";
$h[65]="ข้าวต้มยันหวางคาราโอเกะ";
$h[66]="ข้าวขาหมูเจ้นิด";
$h[67]="น้าแมวข้าวแกงปักษ์ใต้";
$h[68]="กับแกล้มกับข้าว";
$h[69]="ข้าวขาหมู-กระเพาะปลา";
$h[70]="วรากร (ข้าวมันไก่แซ่บ)";
$h[71]="ข้าวมันไก่ลุงอ้วน";
$h[72]="ร้าน ข้าวขาหมูอาม่า";
$h[73]="ร้านข้าวมันไก่เหมยฟ้า";
$h[74]="ร้านเกาเหลาข้าวสวย";
$h[75]="ข้าวมันไก่เบตง";
$h[76]="ร้านข้าวถาดยักษ์";
$h[77]="ข้าวหมกไก่ฮัจยยี่ยูโซ๊ป";
$h[78]="ข้าวแกงแม่จำปา";
$h[79]="ข้าวแกงพี่ไก่";
$h[80]="พามาข้าวแกง";
$h[81]="ข้าวแกงเด็กแนว";
$h[82]="น้องนุ่นข้าวแกง";
$h[83]="ร้านขวัญข้าว";
$h[84]="ข้าวแกงน้องไอดิน";
$h[85]="ร้านโกหอมข้าวหมูแดงโบราณ สาขา3";
$h[86]="ข้าวแกงป้าหงวน";
$h[87]="ข้าวมันไก่นายหัว";
$h[88]="ข้าวแกงเมืองลุง สาขา2 น้อยจอย";
$h[89]="ร้านข้าวหมูแดง-หมูกรอบทองสำเร็จ";
$h[90]="ข้าวมันไก่ ราดหน้า ทุ่งรี";
$h[91]="ข้าวสตู";
$h[92]="ร้านข้าวแกงมะยม";
$h[93]="ร้านข้าวตำรับคุณแม่";
$h[94]="โกเก้า ข้าวมันไก่";
$h[95]="ร้านข้าวต้มเซ้าซี";
$h[96]="ร้านข้าวแกงป้านิ่ม";
$h[97]="OLD CASTLE (ข้าวแกง อาหารตามสั่ง)";
$h[98]="เพชร ข้าวแกงบุฟเฟ่ต์";
$h[99]="ข้าวแกงพี่ไก่ และอาหารตามสั่ง";
$h[100]="โต๊ะกับข้าว";
$h[101]="ข้าวมันไก่โกหย่ง";
$h[102]="ข้าวมันไก่เมียเก่า";
$h[103]="ข้าวแกงแดนใต้";
$h[104]="ข้าวมันไก่เจมส์ 2";
$h[105]="ร้านข้าวแกงละออ";
$h[106]="ร้านข้าวหมูแดงทรงเครื่อง";
$h[107]="ร้านข้าวสตู";
$h[108]="ข้าวเเกงศาลาพักใจ";
$h[109]="เจ๊หญิงข้าวมันไก่";
$h[110]="ข้าวต้มหัวโค้ง";
$h[111]="ข้าวขาหมูอินเตอร์";
$h[112]="ข้าวมันไก่";
$h[113]="ข้าวมันไก่เจ๊ตา";
$h[114]="ข้าวแกงคนคอน ขนมจีนหม้อดิน";
$h[115]="ร้านข้าวแกงพี่อ้อย";
$h[116]="ร้านข้าวหมูแดงป้าณี";
$h[117]="ร้านข้าวมันไก่ โก-ลก";
$h[118]="ร้านซุ้มข้าวยำ";
$h[119]="ร้านข้าวแกงบ้านพรุ(เจ้าเก่า)";
$h[120]="ร้านบุษบาข้าวแกง";
$h[121]="น้องลักษข้าวแกง";
$h[122]="ร้านน้องหมวยข้าวขาหมู";
$h[123]="ร้านข้าวต้มเปียก";
$h[124]="ร้านยินดีข้าวต้มโต้รุ่ง";
$h[125]="ร้านข้าวต้มบ้านพรุ";
$h[126]="ข้าวขาหมู";
$h[127]="ร้านข้าวแกงเมืองตรัง";
$h[128]="ข้าวแกงปักใต้";
$h[129]="ร้านเจ๊ะอุ๊ข้าวมันไก่";
$h[130]="ข้าวแกงคอพาน";
$h[131]="ร้านข้าวแกงเจ้เอ๋";
$h[132]="ร้านข้าวแกงป้าไพ";
$h[133]="ร้านข้าวมันไก่เฮียแว่น";
$h[134]="ร้านลุงภู ข้าวขาหมู";
$h[135]="ร้าน ข้าวแกงอิสลามเมืองตรัง 2";
$h[136]="ร้านอรข้าวหมูแดง";
$h[137]="ข้าวแกงปักษ์ใต้";
$h[138]="ข้าวแกงนครศรี";
$h[139]="ข้าวต้มอั้งม้อ";
$h[140]="ข้าวแกงป้าบัติ";
$h[141]="ข้าวขาหมู";
$h[142]="ร้านข้าวแกงชาวใต้";
$h[143]="ข้าวสตู";
$h[144]="ร้านข้าวหมูแดงชินกิจ (หน้า ญว)";
$h[145]="ร้านข้าวปั้น";
$h[146]="ข้าวมันไก่ทอดขมิ้น";
$h[147]="ร้านข้าวแกงสวนศิริ";
$h[148]="ร้านข้าวมันไก่ราชบุรี";
$h[149]="ข้าวแกงปิ่นแก้ว";
$h[150]="ข้าวแกงนครศรีฯ เจ๊มุ้ย";
$h[151]="ข้าวแกงปากพนัง";
$h[152]="ร้านข้าวแกงวิไล";
$h[153]="ข้าวแกงนายยักษ์";
$h[154]="ข้าวหมูย่างตรัง";
$h[155]="ร้านข้าวแกงเมืองลุง";
$h[156]="ข้าวแกงพี่จิ๋ม";
$h[157]="ครัวข้าวหอม ข้าวแกงเมืองลุง";
$h[158]="ร้านข้าวมันไก่คอหงส์";
$h[159]="ร้านข้าวมันไก่พี่น้องทุ่งลุง";
$h[160]="ร้านข้าวมันไก่ทุ่งลุง(เจ้าเก่า)";
$h[161]="ข้าวขาหมู";
$h[162]="ข้าวแกงเมืองลุง";
$h[163]="ข้าวแกงลุงนึก";
$h[164]="โกเก่งหลานข้าวมันไก่คลองหวะ";
$h[165]="ป้าเหมือน ข้าวหมูทอด";
$h[166]="ร้านข้าวแกงบุษยา";
$h[167]="ร้านข้าวมันไก่ไหหลำ";
$h[168]="ครัวข้าวถุ้ง";
$h[169]="หม้อข้าวหม้อแกง";
$h[170]="คุณสุข้าวขาหมู";
$h[171]="ร้านข้าวดัง หอมดิน";
$h[172]="ข้าวแกงป้าอ้อย";
$h[173]="ข้าวแกงพุงกาง";
$h[174]="ข้าวมันไก่ ก๋วยเตี๋ยวเนื้อเปื่อย";
$h[175]="ข้าวแกงระโนด";
$h[176]="ข้าวแกงอาหารตามสั่งคลองแห";
$h[177]="ข้าวแกงแม่ประดับ";
$h[178]="ข้าวแกงบ้านเบญจวรรณเจ๊ต้อย";
$h[179]="ข้าวต้มโต้รุ่ง";
$h[180]="ร้านศรีข้าวแกง";
$h[181]="นายโอมข้าวมันไก่";
$h[182]="สมนึกผัดไท ข้าวมันไก่";
$h[183]="ข้าวแกงพี่หญิง";
$h[184]="ชะลอมข้าวแกงพื้นบ้าน";
$h[185]="ข้าวหมูแดงบุญเอก";
$h[186]="ร้านข้าวแกงพี่ปราณี";
$h[187]="ข้าวแกงพี่ผิว";
$h[188]="ร้านข้าวหมูแดง หมูกรอบ";
$h[189]="ข้าวหมูแดงชินกิจ";
$h[190]="ร้านข้าวผัดปู";
$h[191]="ร้านข้าวแกงป้าจันทร์";
$h[192]="ป้าติ๋มข้าวแกงนครศรีฯ";
$h[193]="ข้าวมันไก่กันตภณ";
$h[194]="ข้าวขาหมูเห็ดหอม";
$h[195]="ร้านข้าวแกงพัทลุง ครัวโอชา";
$h[196]="ข้าวมันไก่น้องพะแพง";
$h[197]="ข้าวต้มโต้รุ่งธนาทิพย์";
$h[198]="ข้าวแกงพัทลุง";
$h[199]="ข้าวหมูแดงชินกิจ";
$h[200]="ข้าวต้มน้ำทิพย์";
$h[201]="ร้านอาเส็งข้าวขาหมู";
$h[202]="ข้าวมันไก่";
$h[203]="ร้านเเกงราดข้าวหน้าสวน";
$h[204]="ร้านข้าวขาหมูรวมพร";
$h[205]="ร้านป้าแดงข้าวแกง";
$h[206]="เจ๊สุนีข้าวขาหมู";
$h[207]="ข้าวมันไก่ห้าดาว";
$h[208]="ข้าวหมูแดงชินกิจ";
$h[209]="ข้าวแกงครัวเอก";
$h[210]="ข้าวมันไก่เจ๊ะสาว";
$h[211]="ข้าวสวย";
$h[212]="ข้าวต้มนายหัว";
$h[213]="ร้านข้าวต้มธนาทิพย์";
$h[214]="ข้าวต้มปลา";
$h[215]="ร้านข้าวมันไก่ทอดAFC";
$h[216]="ข้าวขาหมู (จันทร์เพ็ญ)";
$h[217]="ข้าวมันไก่รสเด็ด";
$h[218]="รวงข้าว";
$h[219]="ข้าวแกงพี่ติ๋ม";
$h[220]="ข้าวหมูแดงมรกต";
$h[221]="ข้าวแกงเมืองลุง";
$h[222]="ร้านครัวข้าวหอม";
$h[223]="ข้าวมันไก่อิ่มเอม";
$h[224]="ข้าวมันไก่ไหหลำ";
$h[225]="ข้าวมันไก่ไจแอนท์";
$h[226]="ข้าวมันไก่คลองแห";
$h[227]="ข้าวต้มพาสพร";
$h[228]="ข้าวหมูแดงอภัยรัตน์";
$h[229]="ข้าวมันไก่โกฉิก";
$h[230]="ข้าวแกงตนคอน";
$h[231]="ข้าวต้มนายสะอาด";
$h[232]="ข้าวต้มธนาทิพย์";
$h[233]="ป้าพรข้าวแกง";
$h[234]="ข้าวต้ม 1 บาท เขต 8 คุณพีรพัฒน์ ปาน";
$h[235]="ข้าวต้มกุ๊กเมย์";
$h[236]="ข้าวขาหมูเห็ดหอม";
$h[237]="ร้านข้าวศีตะวัน";
$h[238]="ข้าวต้มปลาเก๋า";
$h[239]="ข้าวมันไก่เขต 8";
$h[240]="ข้าวมันไก่เบตง";
$h[241]="ร้านข้าวถ้วย";
$h[242]="ข้าวแกงพี่แอ๊ะ";
$h[243]="ข้าวหมูแดงจุ้ยซิน";
$h[244]="น้องขวัญข้าว";
$h[245]="ข้าวขาหมูเบตง";
$h[246]="อภิชาติข้าวหมูแดง";
$h[247]="ข้าวแกง191";
$h[248]="ข้าวมันไก่ศุภบูรณ์";
$h[249]="ข้าวต้มปลา เจ้าเก่าไร้เทียมทาน";
$h[250]="ข้าวมันไก่เบตง";
$h[251]="ข้าวมันไก่โกหยง";
$h[252]="ภูชงค์ข้าวมันไก่";
$h[253]="ข้าวแกงป้าประดับ";
$h[254]="แม่ตุ้ยข้าวแกงนครศรี";
$h[255]="ข้าวมันไก่ ตรัง";
$h[256]="ร้านสวนข้าวแกง";
$h[257]="ร้านข้าวต้มภาคกลาง";
$h[258]="ข้าวหมูทอดพี่ผอม";
$h[259]="ข้าวมันไก่คลองเตย";
$h[260]="ข้าวมันไก่(นายหมง)";
$h[261]="ร้านฅนกับข้าว";
$h[262]="ร้านอิสลามข้าวหมกไก่";
$h[263]="ข้าวแกงเบญจรงค์";
$h[264]="ร้านข้าวมันไก่ซอย6";
$h[265]="ร้านข้าวแกงมงคล";
$h[266]="ร้านข้าวต้มโกเซี้ย";
$h[267]="ร้านข้าวมันไก่บ้าน";
$h[268]="ร้านข้าวมันไก่ ข้าวขาหมู";
$h[269]="ร้านข้าวแกง พี่ขอม พี่เขียม";
$h[270]="ข้าวแกงชา-กาแฟ";
$h[271]="ร้านข้าวหมูแดงชินกิจ";
$h[272]="ข้าวมันไก่ผาสุข";
$h[273]="เจี้ยนไฉข้าวมันไก่";
$h[274]="ร้านข้าวแกงยายเจียร";
$h[275]="กุ๊กเสริฐ อาหารตามสั่ง ข้าวต้ม";
$h[276]="ข้าวแกงพี่ตุ๋ม";
$h[277]="อาโก้ข้าวขาหมู";
$h[278]="ร้านข้าวแกงป้าทุม";
$h[279]="ข้าวแกงแม่ประนอม";
$h[280]="ข้าวแกงพี่อุไร";
$h[281]="ข้าวหมูแดงแสงทอง";
$h[282]="ข้าวแกงกลางเมือง";
$h[283]="ข้าวแกงเจ๊แอ๊ด";
$h[284]="ข้าวต้มเย็นใจ";
$h[285]="ข้าวต้มเจ๊เพ็ญ";
$h[286]="ข้าวขาหมูอาเก๋า";
$h[287]="ข้าวมันไก่ปาร์ดัง";
$h[288]="ข้าวขาหมูโอปอ";
$h[289]="ข้าวหมูแดงนายแบงค์";
$h[290]="ข้าวขาหมูคู่แฝด";
$h[291]="ข้าวมันไก่เจ๊ต้อย";
$h[292]="ข้าวขาหมูศิภาพัชร์";
$h[293]="ข้าวหมูทอดเจ๊ผอม";
$h[294]="ข้าวต้มปลาอินทรีย์";
$h[295]="ข้าวแกงคุณไพ";
$h[296]="ข้าวหมูแดงศิษฐโล่ห์โภชนา";
$h[297]="ข้าวหมูแดงซัมเม้ง";
$h[298]="ข้าวซอยเชียงใหม่";
$h[299]="ข้าวต้มนายโบว์นครปฐม";
$h[300]="ข้าวต้มเซาะเอก";
$h[301]="ข้าวต้มซอย3";
$h[302]="ข้าวแกงจำเนียร";
$h[303]="เฮียอ้วนข้าวมันไก่";
$h[304]="ข้าวแกงสมชาย";
$h[305]="ข้าวต้มรถแดง";
$h[306]="เซียข้าวต้มปลา";
	
	$i[0]="24/25 ตามสั่ง24ชั่วโมง";
$i[1]="ตำตามสั่ง";
$i[2]="ป้าส้มอาหารตามสั่ง";
$i[3]="ร้านอาหารตามสั่งรวมมิตรบ้านพรุ";
$i[4]="ป้านีอาหารตามสั่ง";
$i[5]="โก้ชีพอาหารตามสั่ง";
$i[6]="ครัวป้าปูอาหารตามสั่ง";
$i[7]="ร้านอาหารทะเลเผาและตามสั่งเรินเรา";
$i[8]="OLD CASTLE (ข้าวแกง อาหารตามสั่ง)";
$i[9]="ข้าวแกงพี่ไก่ และอาหารตามสั่ง";
$i[10]="พี่รมย์ อาหารตามสั่ง";
$i[11]="ครัวลุงถาวร อาหารตามสั่ง";
$i[12]="ร้านพี่นาตอาหารตามสั่ง";
$i[13]="ลูกคนตรัง ผัดไทอาหารตามสั่ง";
$i[14]="ก๋วยเตี๋ยวเรือ อาหารตามสั่ง";
$i[15]="เจ๊โสอาหารตามสั่ง";
$i[16]="ป้านาอาหารตามสั่ง";
$i[17]="เจ๊ไรอาหารตามสั่ง";
$i[18]="ลีลาตามสั่ง";
$i[19]="ร้านเจ้ดา อาหารตามสั่ง";
$i[20]="เจี๊นบโภชนา อาหารตามสั่ง";
$i[21]="ทำหรอย ตามสั่ง";
$i[22]="ร้านตามสั่งจ่า";
$i[23]="iร้านอาหารตามสั่ง";
$i[24]="อิ่มอร่อย ตามสั่ง";
$i[25]="ทิเบต อาหารตามสั่ง";
$i[26]="อาหารตามสั่งหัวสะพาน";
$i[27]="ข้าวแกงอาหารตามสั่งคลองแห";
$i[28]="พี่ไพอาหารตามสั่ง";
$i[29]="พี่สาวอาหารตามสั่ง";
$i[30]="ดินดีซีฟู๊ดอาหารตามสั่ง";
$i[31]="ร้านป้าบัวอาหารตามสั่ง";
$i[32]="ตุ๊กตุ๊กอาหารตามสั่ง";
$i[33]="น้องจูนดีอาหารตามสั่ง";
$i[34]="พี่นีย์อาหารตามสั่ง";
$i[35]="พี่สาวอาหารตามสั่ง";
$i[36]="พี่เล็กอาหารตามสั่ง";
$i[37]="โกวุธอาหารตามสั่ง";
$i[38]="ปุ่น (อาหารตามสั่ง)";
$i[39]="เจ๊หมูตามสั่ง";
$i[40]="ร้านพี่กอล์ฟตามสั่ง";
$i[41]="RED ตามสั่ง";
$i[42]="พี่ติ๋งตามสั่ง";
$i[43]="ป้ากอบอาหารตามสั่ง";
$i[44]="อีสานตามสั่ง";
$i[45]="ป้านีอาหารตามสั่ง";
$i[46]="อาหารตามสั่งหัวสะพาน";
$i[47]="อีสานเพิ่มพูน อาหารตามสั่ง";
$i[48]="ลูกเหลียงอาหารตามสั่ง";
$i[49]="อาหารตามสั่งและเครื่องดื่ม";
$i[50]="กุ๊กเสริฐ อาหารตามสั่ง ข้าวต้ม";
$i[51]="ศรีอาหารตามสั่ง";
$i[52]="ร้านป่าตองอาหารตามสั่ง";
$i[53]="อาหารตามสั่งงามตา";
$i[54]="OLD CASTLE (ข้าวแกง อาหารตามสั่ง)";
$i[55]="ข้าวแกงพี่ไก่ และอาหารตามสั่ง";
$i[56]="ข้าวแกงอาหารตามสั่งคลองแห";
$i[57]="กุ๊กเสริฐ อาหารตามสั่ง ข้าวต้ม";
$i[58]="ร้านอาหารทะเลเผาและตามสั่งเรินเรา";
$i[59]="OLD CASTLE (ข้าวแกง อาหารตามสั่ง)";
$i[60]="ข้าวแกงพี่ไก่ และอาหารตามสั่ง";
$i[61]="พี่รมย์ อาหารตามสั่ง";
$i[62]="ครัวลุงถาวร อาหารตามสั่ง";
$i[63]="ร้านพี่นาตอาหารตามสั่ง";
$i[64]="ลูกคนตรัง ผัดไทอาหารตามสั่ง";
$i[65]="ก๋วยเตี๋ยวเรือ อาหารตามสั่ง";
$i[66]="เจ๊โสอาหารตามสั่ง";
$i[67]="ป้านาอาหารตามสั่ง";
$i[68]="เจ๊ไรอาหารตามสั่ง";
$i[69]="ลีลาตามสั่ง";
$i[70]="ร้านเจ้ดา อาหารตามสั่ง";
$i[71]="เจี๊นบโภชนา อาหารตามสั่ง";
$i[72]="ทำหรอย ตามสั่ง";
$i[73]="ร้านตามสั่งจ่า";
$i[74]="iร้านอาหารตามสั่ง";
$i[75]="อิ่มอร่อย ตามสั่ง";
$i[76]="ทิเบต อาหารตามสั่ง";
$i[77]="อาหารตามสั่งหัวสะพาน";
$i[78]="ข้าวแกงอาหารตามสั่งคลองแห";
$i[79]="พี่ไพอาหารตามสั่ง";
$i[80]="พี่สาวอาหารตามสั่ง";
$i[81]="ดินดีซีฟู๊ดอาหารตามสั่ง";
$i[82]="ร้านป้าบัวอาหารตามสั่ง";
$i[83]="ตุ๊กตุ๊กอาหารตามสั่ง";
$i[84]="น้องจูนดีอาหารตามสั่ง";
$i[85]="พี่นีย์อาหารตามสั่ง";
$i[86]="พี่สาวอาหารตามสั่ง";
$i[87]="พี่เล็กอาหารตามสั่ง";
$i[88]="โกวุธอาหารตามสั่ง";
$i[89]="ปุ่น (อาหารตามสั่ง)";
$i[90]="เจ๊หมูตามสั่ง";
$i[91]="ร้านพี่กอล์ฟตามสั่ง";
$i[92]="RED ตามสั่ง";
$i[93]="พี่ติ๋งตามสั่ง";
$i[94]="ป้ากอบอาหารตามสั่ง";
$i[95]="อีสานตามสั่ง";
$i[96]="ป้านีอาหารตามสั่ง";
$i[97]="อาหารตามสั่งหัวสะพาน";
$i[98]="อีสานเพิ่มพูน อาหารตามสั่ง";
$i[99]="ลูกเหลียงอาหารตามสั่ง";
$i[100]="อาหารตามสั่งและเครื่องดื่ม";
$i[101]="กุ๊กเสริฐ อาหารตามสั่ง ข้าวต้ม";
$i[102]="ศรีอาหารตามสั่ง";
$i[103]="ร้านป่าตองอาหารตามสั่ง";
$i[104]="อาหารตามสั่งงามตา";


	foreach ($events['events'] as $event) {
		
		if ($event['type'] == 'join'
		    
		    {
		    
		 
			// Build message to reply back
	
			$messages3 = [
				
			
				'type' => 'text',
				'text' => 'Welcome'
				
					];
			
			

			// Make a POST Request to Messaging API to reply to sender
			$url = 'https://api.line.me/v2/bot/message/reply';
			$data = [
				'replyToken' => $replyToken,
				'messages' => [$messages3],
				
				
			];
			$post = json_encode($data);
			$headers = array('Content-Type: application/json', 'Authorization: Bearer ' . $access_token);

			$ch = curl_init($url);
			curl_setopt($ch, CURLOPT_CUSTOMREQUEST, "POST");
			curl_setopt($ch, CURLOPT_RETURNTRANSFER, true);
			curl_setopt($ch, CURLOPT_POSTFIELDS, $post);
			curl_setopt($ch, CURLOPT_HTTPHEADER, $headers);
			curl_setopt($ch, CURLOPT_FOLLOWLOCATION, 1);
			$result = curl_exec($ch);
			curl_close($ch);

			echo $result . "\r\n";
		}
		    
		    }
		
		// Reply only when message sent is in 'text' format
	
		$text_mes=$event['message']['text'];
		
		$last_mes = substr(trim($text_mes), -1);
		$first_mes = $text_mes[0];
		
		
			if ($event['type'] == 'message' && $event['message']['type'] == 'text' && $last_mes=='*' && $first_mes == '*' )
		{
		$text_mes = trim($event['message']['text']);
		$text_mes=substr_replace($text_mes, '', -1 , 1);
		$text_mes=substr_replace($text_mes, '', 0 , 1);
		$text_mes = trim($text_mes);
				
			if ($event['type'] == 'message' && $event['message']['type'] == 'text' && $text_mes == "all list")
		{
		
	//	$random_keys=array_rand($a,1);
		
			
			
		//$text = $event['message']['text'];
			$randomnumber='';
			for($i=0;$i<2013;$i++)
			{
				$randomnumber = $randomnumber.$a[$i]."\n";
			}
			
				
				
				
				
			//	$randomnumber = "all member";      ////////////////check
			// Get replyToken
			
			
			$replyToken = $event['replyToken'];

			// Build message to reply back
	
			$messages3 = [
				
			
				'type' => 'text',
				'text' => $randomnumber
				
					];
			
			

			// Make a POST Request to Messaging API to reply to sender
			$url = 'https://api.line.me/v2/bot/message/reply';
			$data = [
				'replyToken' => $replyToken,
				'messages' => [$messages3],
				
				
			];
			$post = json_encode($data);
			$headers = array('Content-Type: application/json', 'Authorization: Bearer ' . $access_token);

			$ch = curl_init($url);
			curl_setopt($ch, CURLOPT_CUSTOMREQUEST, "POST");
			curl_setopt($ch, CURLOPT_RETURNTRANSFER, true);
			curl_setopt($ch, CURLOPT_POSTFIELDS, $post);
			curl_setopt($ch, CURLOPT_HTTPHEADER, $headers);
			curl_setopt($ch, CURLOPT_FOLLOWLOCATION, 1);
			$result = curl_exec($ch);
			curl_close($ch);

			echo $result . "\r\n";
		
		
		}	
				
				else if ($event['type'] == 'message' && $event['message']['type'] == 'text' && $text_mes == "random")
		{
		//$text = $event['message']['text'];
			
			$randomnumber = rand(0,99);
			// Get replyToken
			$replyToken = $event['replyToken'];

			// Build message to reply back
	
			$messages3 = [
				
			
				'type' => 'text',
				'text' => $randomnumber
				
					];
			
			

			// Make a POST Request to Messaging API to reply to sender
			$url = 'https://api.line.me/v2/bot/message/reply';
			$data = [
				'replyToken' => $replyToken,
				'messages' => [$messages3],
				
				
			];
			$post = json_encode($data);
			$headers = array('Content-Type: application/json', 'Authorization: Bearer ' . $access_token);

			$ch = curl_init($url);
			curl_setopt($ch, CURLOPT_CUSTOMREQUEST, "POST");
			curl_setopt($ch, CURLOPT_RETURNTRANSFER, true);
			curl_setopt($ch, CURLOPT_POSTFIELDS, $post);
			curl_setopt($ch, CURLOPT_HTTPHEADER, $headers);
			curl_setopt($ch, CURLOPT_FOLLOWLOCATION, 1);
			$result = curl_exec($ch);
			curl_close($ch);

			echo $result . "\r\n";
		}
							
				else if ($event['type'] == 'message' && $event['message']['type'] == 'text' && substr( $text_mes, 0, 6 ) === "filter")
		{
		//$text = $event['message']['text'];
			
					$array_rand=explode(" ",$text_mes);
					
			$randomnumber = rand($array_rand[1],$array_rand[2]);
			// Get replyToken
			$replyToken = $event['replyToken'];

			// Build message to reply back
	
			$messages3 = [
				
			
				'type' => 'text',
				'text' => $randomnumber
				
					];
			
			

			// Make a POST Request to Messaging API to reply to sender
			$url = 'https://api.line.me/v2/bot/message/reply';
			$data = [
				'replyToken' => $replyToken,
				'messages' => [$messages3],
				
				
			];
			$post = json_encode($data);
			$headers = array('Content-Type: application/json', 'Authorization: Bearer ' . $access_token);

			$ch = curl_init($url);
			curl_setopt($ch, CURLOPT_CUSTOMREQUEST, "POST");
			curl_setopt($ch, CURLOPT_RETURNTRANSFER, true);
			curl_setopt($ch, CURLOPT_POSTFIELDS, $post);
			curl_setopt($ch, CURLOPT_HTTPHEADER, $headers);
			curl_setopt($ch, CURLOPT_FOLLOWLOCATION, 1);
			$result = curl_exec($ch);
			curl_close($ch);

			echo $result . "\r\n";
		}
		
		else if ($event['type'] == 'message' && $event['message']['type'] == 'text' && substr( $text_mes, 0, 6 ) === "random")
		{
		//$text = $event['message']['text'];
			
					$array_rand=explode(" ",$text_mes);
					
			$randomnumber = rand($array_rand[1],$array_rand[2]);
			// Get replyToken
			$replyToken = $event['replyToken'];

			// Build message to reply back
	
			$messages3 = [
				
			
				'type' => 'text',
				'text' => $randomnumber
				
					];
			
			

			// Make a POST Request to Messaging API to reply to sender
			$url = 'https://api.line.me/v2/bot/message/reply';
			$data = [
				'replyToken' => $replyToken,
				'messages' => [$messages3],
				
				
			];
			$post = json_encode($data);
			$headers = array('Content-Type: application/json', 'Authorization: Bearer ' . $access_token);

			$ch = curl_init($url);
			curl_setopt($ch, CURLOPT_CUSTOMREQUEST, "POST");
			curl_setopt($ch, CURLOPT_RETURNTRANSFER, true);
			curl_setopt($ch, CURLOPT_POSTFIELDS, $post);
			curl_setopt($ch, CURLOPT_HTTPHEADER, $headers);
			curl_setopt($ch, CURLOPT_FOLLOWLOCATION, 1);
			$result = curl_exec($ch);
			curl_close($ch);

			echo $result . "\r\n";
		}
				
				
				
				
				
				
				
				else if ($event['type'] == 'message' && $event['message']['type'] == 'text' && $text_mes == "all member")
		{
		
	//	$random_keys=array_rand($a,1);
		
			
			
		//$text = $event['message']['text'];
			$randomnumber='';
			for($i=0;$i<6;$i++)
			{
				$randomnumber = $randomnumber.$b[$i]."\n";
			}
				
			//	$randomnumber ="all vip"; /////////check
			// Get replyToken
			
			
			$replyToken = $event['replyToken'];

			// Build message to reply back
	
			$messages3 = [
				
			
				'type' => 'text',
				'text' => $randomnumber
				
					];
			
			

			// Make a POST Request to Messaging API to reply to sender
			$url = 'https://api.line.me/v2/bot/message/reply';
			$data = [
				'replyToken' => $replyToken,
				'messages' => [$messages3],
				
				
			];
			$post = json_encode($data);
			$headers = array('Content-Type: application/json', 'Authorization: Bearer ' . $access_token);

			$ch = curl_init($url);
			curl_setopt($ch, CURLOPT_CUSTOMREQUEST, "POST");
			curl_setopt($ch, CURLOPT_RETURNTRANSFER, true);
			curl_setopt($ch, CURLOPT_POSTFIELDS, $post);
			curl_setopt($ch, CURLOPT_HTTPHEADER, $headers);
			curl_setopt($ch, CURLOPT_FOLLOWLOCATION, 1);
			$result = curl_exec($ch);
			curl_close($ch);

			echo $result . "\r\n";
		
		
		}	
				
		/*else if ($event['type'] == 'message' && $event['message']['type'] == 'text' && $text_mes == "ran list")*/
		else if ($event['type'] == 'message' && $event['message']['type'] == 'text' && $text_mes == "โค้กกินกับอะไรก็อร่อย")		
		{
		
	//	$random_keys=array_rand($a,1);
		
			
			
		//$text = $event['message']['text'];
			
			$randomnumber = $a[rand(0,2012)];
		//	$randomnumber = "ran member"; ///////check
			// Get replyToken
			
			
			$replyToken = $event['replyToken'];

			// Build message to reply back
	
			$messages3 = [
				
			
				'type' => 'text',
				'text' => $randomnumber
				
					];
			
			

			// Make a POST Request to Messaging API to reply to sender
			$url = 'https://api.line.me/v2/bot/message/reply';
			$data = [
				'replyToken' => $replyToken,
				'messages' => [$messages3],
				
				
			];
			$post = json_encode($data);
			$headers = array('Content-Type: application/json', 'Authorization: Bearer ' . $access_token);

			$ch = curl_init($url);
			curl_setopt($ch, CURLOPT_CUSTOMREQUEST, "POST");
			curl_setopt($ch, CURLOPT_RETURNTRANSFER, true);
			curl_setopt($ch, CURLOPT_POSTFIELDS, $post);
			curl_setopt($ch, CURLOPT_HTTPHEADER, $headers);
			curl_setopt($ch, CURLOPT_FOLLOWLOCATION, 1);
			$result = curl_exec($ch);
			curl_close($ch);

			echo $result . "\r\n";
		
		
		}
				
				
				
				else if ($event['type'] == 'message' && $event['message']['type'] == 'text' && $text_mes == "กินโค้กกับขนมจีน")		
		{
		
	//	$random_keys=array_rand($a,1);
		
			
			
		//$text = $event['message']['text'];
			
			$randomnumber = $c[rand(0,38)];
		//	$randomnumber = "ran member"; ///////check
			// Get replyToken
			
			
			$replyToken = $event['replyToken'];

			// Build message to reply back
	
			$messages3 = [
				
			
				'type' => 'text',
				'text' => $randomnumber
				
					];
			
			

			// Make a POST Request to Messaging API to reply to sender
			$url = 'https://api.line.me/v2/bot/message/reply';
			$data = [
				'replyToken' => $replyToken,
				'messages' => [$messages3],
				
				
			];
			$post = json_encode($data);
			$headers = array('Content-Type: application/json', 'Authorization: Bearer ' . $access_token);

			$ch = curl_init($url);
			curl_setopt($ch, CURLOPT_CUSTOMREQUEST, "POST");
			curl_setopt($ch, CURLOPT_RETURNTRANSFER, true);
			curl_setopt($ch, CURLOPT_POSTFIELDS, $post);
			curl_setopt($ch, CURLOPT_HTTPHEADER, $headers);
			curl_setopt($ch, CURLOPT_FOLLOWLOCATION, 1);
			$result = curl_exec($ch);
			curl_close($ch);

			echo $result . "\r\n";
		
		
		}
				else if ($event['type'] == 'message' && $event['message']['type'] == 'text' && $text_mes == "กินโค้กกับก๋วยเตี๋ยว")		
		{
		
	//	$random_keys=array_rand($a,1);
		
			
			
		//$text = $event['message']['text'];
			
			$randomnumber = $f[rand(0,225)];
		//	$randomnumber = "ran member"; ///////check
			// Get replyToken
			
			
			$replyToken = $event['replyToken'];

			// Build message to reply back
	
			$messages3 = [
				
			
				'type' => 'text',
				'text' => $randomnumber
				
					];
			
			

			// Make a POST Request to Messaging API to reply to sender
			$url = 'https://api.line.me/v2/bot/message/reply';
			$data = [
				'replyToken' => $replyToken,
				'messages' => [$messages3],
				
				
			];
			$post = json_encode($data);
			$headers = array('Content-Type: application/json', 'Authorization: Bearer ' . $access_token);

			$ch = curl_init($url);
			curl_setopt($ch, CURLOPT_CUSTOMREQUEST, "POST");
			curl_setopt($ch, CURLOPT_RETURNTRANSFER, true);
			curl_setopt($ch, CURLOPT_POSTFIELDS, $post);
			curl_setopt($ch, CURLOPT_HTTPHEADER, $headers);
			curl_setopt($ch, CURLOPT_FOLLOWLOCATION, 1);
			$result = curl_exec($ch);
			curl_close($ch);

			echo $result . "\r\n";
		
		
		}
				
				else if ($event['type'] == 'message' && $event['message']['type'] == 'text' && $text_mes == "กินโค้กกับชาบู")		
		{
		
	//	$random_keys=array_rand($a,1);
		
			
			
		//$text = $event['message']['text'];
			
			$randomnumber = $g[rand(0,11)];
		//	$randomnumber = "ran member"; ///////check
			// Get replyToken
			
			
			$replyToken = $event['replyToken'];

			// Build message to reply back
	
			$messages3 = [
				
			
				'type' => 'text',
				'text' => $randomnumber
				
					];
			
			

			// Make a POST Request to Messaging API to reply to sender
			$url = 'https://api.line.me/v2/bot/message/reply';
			$data = [
				'replyToken' => $replyToken,
				'messages' => [$messages3],
				
				
			];
			$post = json_encode($data);
			$headers = array('Content-Type: application/json', 'Authorization: Bearer ' . $access_token);

			$ch = curl_init($url);
			curl_setopt($ch, CURLOPT_CUSTOMREQUEST, "POST");
			curl_setopt($ch, CURLOPT_RETURNTRANSFER, true);
			curl_setopt($ch, CURLOPT_POSTFIELDS, $post);
			curl_setopt($ch, CURLOPT_HTTPHEADER, $headers);
			curl_setopt($ch, CURLOPT_FOLLOWLOCATION, 1);
			$result = curl_exec($ch);
			curl_close($ch);

			echo $result . "\r\n";
		
		
		}
	
				else if ($event['type'] == 'message' && $event['message']['type'] == 'text' && $text_mes == "กินโค้กกับสเต็ก")		
		{
		
	//	$random_keys=array_rand($a,1);
		
			
			
		//$text = $event['message']['text'];
			
			$randomnumber = $d[rand(0,18)];
		//	$randomnumber = "ran member"; ///////check
			// Get replyToken
			
			
			$replyToken = $event['replyToken'];

			// Build message to reply back
	
			$messages3 = [
				
			
				'type' => 'text',
				'text' => $randomnumber
				
					];
			
			

			// Make a POST Request to Messaging API to reply to sender
			$url = 'https://api.line.me/v2/bot/message/reply';
			$data = [
				'replyToken' => $replyToken,
				'messages' => [$messages3],
				
				
			];
			$post = json_encode($data);
			$headers = array('Content-Type: application/json', 'Authorization: Bearer ' . $access_token);

			$ch = curl_init($url);
			curl_setopt($ch, CURLOPT_CUSTOMREQUEST, "POST");
			curl_setopt($ch, CURLOPT_RETURNTRANSFER, true);
			curl_setopt($ch, CURLOPT_POSTFIELDS, $post);
			curl_setopt($ch, CURLOPT_HTTPHEADER, $headers);
			curl_setopt($ch, CURLOPT_FOLLOWLOCATION, 1);
			$result = curl_exec($ch);
			curl_close($ch);

			echo $result . "\r\n";
		
		
		}
				
				else if ($event['type'] == 'message' && $event['message']['type'] == 'text' && $text_mes == "กินโค้กกับข้าว")		
		{
		
	//	$random_keys=array_rand($a,1);
		
			
			
		//$text = $event['message']['text'];
			
			$randomnumber = $h[rand(0,306)];
		//	$randomnumber = "ran member"; ///////check
			// Get replyToken
			
			
			$replyToken = $event['replyToken'];

			// Build message to reply back
	
			$messages3 = [
				
			
				'type' => 'text',
				'text' => $randomnumber
				
					];
			
			

			// Make a POST Request to Messaging API to reply to sender
			$url = 'https://api.line.me/v2/bot/message/reply';
			$data = [
				'replyToken' => $replyToken,
				'messages' => [$messages3],
				
				
			];
			$post = json_encode($data);
			$headers = array('Content-Type: application/json', 'Authorization: Bearer ' . $access_token);

			$ch = curl_init($url);
			curl_setopt($ch, CURLOPT_CUSTOMREQUEST, "POST");
			curl_setopt($ch, CURLOPT_RETURNTRANSFER, true);
			curl_setopt($ch, CURLOPT_POSTFIELDS, $post);
			curl_setopt($ch, CURLOPT_HTTPHEADER, $headers);
			curl_setopt($ch, CURLOPT_FOLLOWLOCATION, 1);
			$result = curl_exec($ch);
			curl_close($ch);

			echo $result . "\r\n";
		
		
		}
				
					else if ($event['type'] == 'message' && $event['message']['type'] == 'text' && $text_mes == "กินโค้กกับส้มตำ")		
		{
		
	//	$random_keys=array_rand($a,1);
		
			
			
		//$text = $event['message']['text'];
			
			$randomnumber = $e[rand(0,95)];
		//	$randomnumber = "ran member"; ///////check
			// Get replyToken
			
			
			$replyToken = $event['replyToken'];

			// Build message to reply back
	
			$messages3 = [
				
			
				'type' => 'text',
				'text' => $randomnumber
				
					];
			
			

			// Make a POST Request to Messaging API to reply to sender
			$url = 'https://api.line.me/v2/bot/message/reply';
			$data = [
				'replyToken' => $replyToken,
				'messages' => [$messages3],
				
				
			];
			$post = json_encode($data);
			$headers = array('Content-Type: application/json', 'Authorization: Bearer ' . $access_token);

			$ch = curl_init($url);
			curl_setopt($ch, CURLOPT_CUSTOMREQUEST, "POST");
			curl_setopt($ch, CURLOPT_RETURNTRANSFER, true);
			curl_setopt($ch, CURLOPT_POSTFIELDS, $post);
			curl_setopt($ch, CURLOPT_HTTPHEADER, $headers);
			curl_setopt($ch, CURLOPT_FOLLOWLOCATION, 1);
			$result = curl_exec($ch);
			curl_close($ch);

			echo $result . "\r\n";
		
		
		}
			
					else if ($event['type'] == 'message' && $event['message']['type'] == 'text' && $text_mes == "กินโค้กกับอาหารตามสั่ง")		
		{
		
	//	$random_keys=array_rand($a,1);
		
			
			
		//$text = $event['message']['text'];
			
			$randomnumber = $i[rand(0,104)];
		//	$randomnumber = "ran member"; ///////check
			// Get replyToken
			
			
			$replyToken = $event['replyToken'];

			// Build message to reply back
	
			$messages3 = [
				
			
				'type' => 'text',
				'text' => $randomnumber
				
					];
			
			

			// Make a POST Request to Messaging API to reply to sender
			$url = 'https://api.line.me/v2/bot/message/reply';
			$data = [
				'replyToken' => $replyToken,
				'messages' => [$messages3],
				
				
			];
			$post = json_encode($data);
			$headers = array('Content-Type: application/json', 'Authorization: Bearer ' . $access_token);

			$ch = curl_init($url);
			curl_setopt($ch, CURLOPT_CUSTOMREQUEST, "POST");
			curl_setopt($ch, CURLOPT_RETURNTRANSFER, true);
			curl_setopt($ch, CURLOPT_POSTFIELDS, $post);
			curl_setopt($ch, CURLOPT_HTTPHEADER, $headers);
			curl_setopt($ch, CURLOPT_FOLLOWLOCATION, 1);
			$result = curl_exec($ch);
			curl_close($ch);

			echo $result . "\r\n";
		
		
		}
				
				
				else if ($event['type'] == 'message' && $event['message']['type'] == 'text' && $text_mes == "ran member")
		{
		//$random_keys=array_rand($a,1);
		
			
			
		//$text = $event['message']['text'];
			
			$randomnumber = $b[rand(0,5)];
		//	$randomnumber = "ran vip"; /////check
			// Get replyToken
			
			
			$replyToken = $event['replyToken'];

			// Build message to reply back
	
			$messages3 = [
				
			
				'type' => 'text',
				'text' => $randomnumber
				
					];
			
			

			// Make a POST Request to Messaging API to reply to sender
			$url = 'https://api.line.me/v2/bot/message/reply';
			$data = [
				'replyToken' => $replyToken,
				'messages' => [$messages3],
				
				
			];
			$post = json_encode($data);
			$headers = array('Content-Type: application/json', 'Authorization: Bearer ' . $access_token);

			$ch = curl_init($url);
			curl_setopt($ch, CURLOPT_CUSTOMREQUEST, "POST");
			curl_setopt($ch, CURLOPT_RETURNTRANSFER, true);
			curl_setopt($ch, CURLOPT_POSTFIELDS, $post);
			curl_setopt($ch, CURLOPT_HTTPHEADER, $headers);
			curl_setopt($ch, CURLOPT_FOLLOWLOCATION, 1);
			$result = curl_exec($ch);
			curl_close($ch);

			echo $result . "\r\n";
		
		}
				
		
		
		else if ($event['type'] == 'message' && $event['message']['type'] == 'text') {
			// Get text sent
			$text = $text_mes;
			
			//$text=$last_mes.'pppppppppppp'.$first_mes;
			
		//	$randomnumber = rand(10,100);
			// Get replyToken
			$replyToken = $event['replyToken'];

			// Build message to reply back
			$messages = [
				
				'type' => 'sticker',
				'packageId' => '4',
				'stickerId' => '630'
				
					];
			
			
							$messages2 = [
				
			
				'type' => 'text',
				'text' => $text
				
					];
			
			

			// Make a POST Request to Messaging API to reply to sender
			$url = 'https://api.line.me/v2/bot/message/reply';
			$data = [
				'replyToken' => $replyToken,
				'messages' => [$messages2,$messages],
				
				
			];
			$post = json_encode($data);
			$headers = array('Content-Type: application/json', 'Authorization: Bearer ' . $access_token);

			$ch = curl_init($url);
			curl_setopt($ch, CURLOPT_CUSTOMREQUEST, "POST");
			curl_setopt($ch, CURLOPT_RETURNTRANSFER, true);
			curl_setopt($ch, CURLOPT_POSTFIELDS, $post);
			curl_setopt($ch, CURLOPT_HTTPHEADER, $headers);
			curl_setopt($ch, CURLOPT_FOLLOWLOCATION, 1);
			$result = curl_exec($ch);
			curl_close($ch);

			echo $result . "\r\n";
		}
				
				
			} ///ifff chicken:

	
	
	}
}
echo "OK";

